[
  {
    "title": "The Winepress",
    "source": "Josef Essberger",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/winepress-300.jpg",
    "createdDate": null,
    "content": "\"You don't have to be French to enjoy a decent red wine,\" Charles Jousselin de Gruse used to tell his foreign guests whenever he entertained them in Paris. \"But you do have to be French to recognize one,\" he would add with a laugh.\n\nAfter a lifetime in the French diplomatic corps, the Count de Gruse lived with his wife in an elegant townhouse on Quai Voltaire. He was a likeable man, cultivated of course, with a well-deserved reputation as a generous host and an amusing raconteur.\n\nThis evening's guests were all European and all equally convinced that immigration was at the root of Europe's problems. Charles de Gruse said nothing. He had always concealed his contempt for such ideas. And, in any case, he had never much cared for these particular guests.\n\nThe first of the red Bordeaux was being served with the veal, and one of the guests turned to de Gruse.\n\n\"Come on, Charles, it's simple arithmetic. Nothing to do with race or colour. You must've had bags of experience of this sort of thing. What d'you say?\"\n\n\"Yes, General. Bags!\"\n\nWithout another word, de Gruse picked up his glass and introduced his bulbous, winey nose. After a moment he looked up with watery eyes.\n\n\"A truly full-bodied Bordeaux,\" he said warmly, \"a wine among wines.\"\n\nThe four guests held their glasses to the light and studied their blood-red contents. They all agreed that it was the best wine they had ever tasted.\n\nOne by one the little white lights along the Seine were coming on, and from the first-floor windows you could see the brightly lit bateaux-mouches passing through the arches of the Pont du Carrousel. The party moved on to a dish of game served with a more vigorous claret.\n\n\"Can you imagine,\" asked de Gruse, as the claret was poured, \"that there are people who actually serve wines they know nothing about?\"\n\n\"Really?\" said one of the guests, a German politician.\n\n\"Personally, before I uncork a bottle I like to know what's in it.\"\n\n\"But how? How can anyone be sure?\"\n\n\"I like to hunt around the vineyards. Take this place I used to visit in Bordeaux. I got to know the winegrower there personally. That's the way to know what you're drinking.\"\n\n\"A matter of pedigree, Charles,\" said the other politician.\n\n\"This fellow,\" continued de Gruse as though the Dutchman had not spoken, \"always gave you the story behind his wines. One of them was the most extraordinary story I ever heard. We were tasting, in his winery, and we came to a cask that made him frown. He asked if I agreed with him that red Bordeaux was the best wine in the world. Of course, I agreed. Then he made the strangest statement.\n\n\"'The wine in this cask,' he said, and there were tears in his eyes, 'is the best vintage in the world. But it started its life far from the country where it was grown.'\"\n\nDe Gruse paused to check that his guests were being served.\n\n\"Well?\" said the Dutchman.\n\nDe Gruse and his wife exchanged glances.\n\n\"Do tell them, mon chéri,\" she said.\n\nDe Gruse leaned forwards, took another sip of wine, and dabbed his lips with the corner of his napkin. This is the story he told them.\n\nAt the age of twenty-one, Pierre - that was the name he gave the winegrower - had been sent by his father to spend some time with his uncle in Madagascar. Within two weeks he had fallen for a local girl called Faniry, or \"Desire\" in Malagasy. You could not blame him. At seventeen she was ravishing. In the Malagasy sunlight her skin was golden. Her black, waist-length hair, which hung straight beside her cheeks, framed large, fathomless eyes. It was a genuine coup de foudre, for both of them. Within five months they were married. Faniry had no family, but Pierre's parents came out from France for the wedding, even though they did not strictly approve of it, and for three years the young couple lived very happily on the island of Madagascar. Then, one day, a telegram came from France. Pierre's parents and his only brother had been killed in a car crash. Pierre took the next flight home to attend the funeral and manage the vineyard left by his father.\n\nFaniry followed two weeks later. Pierre was grief-stricken, but with Faniry he settled down to running the vineyard. His family, and the lazy, idyllic days under a tropical sun, were gone forever. But he was very happily married, and he was very well-off. Perhaps, he reasoned, life in Bordeaux would not be so bad.\n\nBut he was wrong. It soon became obvious that Faniry was jealous. In Madagascar she had no match. In France she was jealous of everyone. Of the maids. Of the secretary. Even of the peasant girls who picked the grapes and giggled at her funny accent. She convinced herself that Pierre made love to each of them in turn.\n\nShe started with insinuations, simple, artless ones that Pierre hardly even recognized. Then she tried blunt accusation in the privacy of their bedroom. When he denied that, she resorted to violent, humiliating denouncements in the kitchens, the winery, the plantations. The angel that Pierre had married in Madagascar had become a termagant, blinded by jealousy. Nothing he did or said could help. Often, she would refuse to speak for a week or more, and when at last she spoke it would only be to scream yet more abuse or swear again her intention to leave him. By the third vine-harvest it was obvious to everyone that they loathed each other.\n\nOne Friday evening, Pierre was down in the winery, working on a new electric winepress. He was alone. The grape-pickers had left. Suddenly the door opened and Faniry entered, excessively made up. She walked straight up to Pierre, flung her arms around his neck, and pressed herself against him. Even above the fumes from the pressed grapes he could smell that she had been drinking.\n\n\"Darling,\" she sighed, \"what shall we do?\"\n\nHe badly wanted her, but all the past insults and humiliating scenes welled up inside him. He pushed her away.\n\n\"But, darling, I'm going to have a baby.\"\n\n\"Don't be absurd. Go to bed! You're drunk. And take that paint off. It makes you look like a tart.\"\n\nFaniry's face blackened, and she threw herself at him with new accusations. He had never cared for her. He cared only about sex. He was obsessed with it. And with white women. But the women in France, the white women, they were the tarts, and he was welcome to them. She snatched a knife from the wall and lunged at him with it. She was in tears, but it took all his strength to keep the knife from his throat. Eventually he pushed her off, and she stumbled towards the winepress. Pierre stood, breathing heavily, as the screw of the press caught at her hair and dragged her in. She screamed, struggling to free herself. The screw bit slowly into her shoulder and she screamed again. Then she fainted, though whether from the pain or the fumes he was not sure. He looked away until a sickening sound told him it was over. Then he raised his arm and switched the current off.\n\nThe guests shuddered visibly and de Gruse paused in his story.\n\n\"Well, I won't go into the details at table,\" he said. \"Pierre fed the rest of the body into the press and tidied up. Then he went up to the house, had a bath, ate a meal, and went to bed. The next day, he told everyone Faniry had finally left him and gone back to Madagascar. No-one was surprised.\"\n\nHe paused again. His guests sat motionless, their eyes turned towards him.\n\n\"Of course,\" he continued, \"Sixty-five was a bad year for red Bordeaux. Except for Pierre's. That was the extraordinary thing. It won award after award, and nobody could understand why.\"\n\nThe general's wife cleared her throat.\n\n\"But, surely,\" she said, \"you didn't taste it?\"\n\n\"No, I didn't taste it, though Pierre did assure me his wife had lent the wine an incomparable aroma.\"\n\n\"And you didn't, er, buy any?\" asked the general.\n\n\"How could I refuse? It isn't every day that one finds such a pedigree.\"\n\nThere was a long silence. The Dutchman shifted awkwardly in his seat, his glass poised midway between the table and his open lips. The other guests looked around uneasily at each other. They did not understand.\n\n\"But look here, Gruse,\" said the general at last, \"you don't mean to tell me we're drinking this damned woman now, d'you?\"\n\nDe Gruse gazed impassively at the Englishman.\n\n\"Heaven forbid, General,\" he said slowly. \"Everyone knows that the best vintage should always come first.\"",
    "shortDescription": "\"You don't have to be French to enjoy a decent red wine\"",
    "level" : "intermediate",
    "language" : "english"
  },
  {
    "title": "The boy who cried wolf",
    "source": "unknown",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/The-Boy-Who-Cried-Wolf.webp",
    "createdDate": null,
    "content": "Once, there was a boy who became bored when he watched over the village sheep grazing on the hillside. To entertain himself, he sang out, “Wolf! Wolf! The wolf is chasing the sheep!”\n\nWhen the villagers heard the cry, they came running up the hill to drive the wolf away. But, when they arrived, they saw no wolf. The boy was amused when seeing their angry faces.\n\n“Don’t scream wolf, boy,” warned the villagers, “when there is no wolf!” They angrily went back down the hill.\n\nLater, the shepherd boy cried out once again, “Wolf! Wolf! The wolf is chasing the sheep!” To his amusement, he looked on as the villagers came running up the hill to scare the wolf away.\n\nAs they saw there was no wolf, they said strictly, “Save your frightened cry for when there really is a wolf! Don’t cry ‘wolf’ when there is no wolf!” But the boy grinned at their words while they walked grumbling down the hill once more.\n\nLater, the boy saw a real wolf sneaking around his flock. Alarmed, he jumped on his feet and cried out as loud as he could, “Wolf! Wolf!” But the villagers thought he was fooling them again, and so they didn’t come to help.\n\nAt sunset, the villagers went looking for the boy who hadn’t returned with their sheep. When they went up the hill, they found him weeping.\n\n“There really was a wolf here! The flock is gone! I cried out, ‘Wolf!’ but you didn’t come,” he wailed.\n\nAn old man went to comfort the boy. As he put his arm around him, he said, “Nobody believes a liar, even when he is telling the truth!”",
    "shortDescription": "Once, there was a boy who became bored when he watched over the village sheep grazing on the hillside. ",
    "level" : "elementary",
    "language" : "english"
  },
  {
    "title": "The golden touch",
    "source": "unknown",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/The-Golden-Touch.webp",
    "createdDate": null,
    "content": "There once was a king named Midas who did a good deed for a Satyr. And he was then granted a wish by Dionysus, the god of wine.\n\nFor his wish, Midas asked that whatever he touched would turn to gold. Despite Dionysus’ efforts to prevent it, Midas pleaded that this was a fantastic wish, and so, it was bestowed.\n\nExcited about his newly-earned powers, Midas started touching all kinds of things, turning each item into pure gold.\n\nBut soon, Midas became hungry. As he picked up a piece of food, he found he couldn’t eat it. It had turned to gold in his hand.\n\nHungry, Midas groaned, “I’ll starve! Perhaps this was not such an excellent wish after all!”\n\nSeeing his dismay, Midas’ beloved daughter threw her arms around him to comfort him, and she, too, turned to gold. “The golden touch is no blessing,” Midas cried.",
    "shortDescription": "There once was a king named Midas who did a good deed for a Satyr. And he was then granted a wish by Dionysus, the god of wine.",
    "level" : "elementary",
    "language" : "english"
  },
  {
    "title": "The Fox and the Grapes",
    "source": "unknown",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/The-Fox-and-the-Grapes-scaled.webp",
    "createdDate": null,
    "content": "One day, a fox became very hungry as he went to search for some food. He searched high and low, but couldn’t find something that he could eat.\n\nFinally, as his stomach rumbled, he stumbled upon a farmer’s wall. At the top of the wall, he saw the biggest, juiciest grapes he’d ever seen. They had a rich, purple color, telling the fox they were ready to be eaten.\n\nTo reach the grapes, the fox had to jump high in the air. As he jumped, he opened his mouth to catch the grapes, but he missed. The fox tried again but missed yet again.\n\nHe tried a few more times but kept failing.\n\nFinally, the fox decided it was time to give up and go home. While he walked away, he muttered, “I’m sure the grapes were sour anyway.”",
    "shortDescription": "One day, a fox became very hungry as he went to search for some food. He searched high and low, but couldn’t find something that he could eat.",
    "level" : "elementary",
    "language" : "english"
  },
  {
    "title": "The Proud Rose",
    "source": "unknown",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/The-proud-rose.webp",
    "createdDate": null,
    "content": "Once upon a time, in a desert far away, there was a rose who was so proud of her beautiful looks. Her only complaint was growing next to an ugly cactus.\n\nEvery day, the beautiful rose would insult and mock the cactus on his looks, all while the cactus remained quiet. All the other plants nearby tried to make the rose see sense, but she was too swayed by her own looks.\n\nOne scorching summer, the desert became dry, and there was no water left for the plants. The rose quickly began to wilt. Her beautiful petals dried up, losing their lush color.\n\nLooking to the cactus, she saw a sparrow dip his beak into the cactus to drink some water. Though ashamed, the rose asked the cactus if she could have some water. The kind cactus readily agreed, helping them both through the tough summer, as friends.",
    "shortDescription": "Once upon a time, in a desert far away, there was a rose who was so proud of her beautiful looks.",
    "level" : "elementary",
    "language" : "english"
  },
  {
    "title": "The Milkmaid and Her Pail",
    "source": "unknown",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/The-Milkmaid-and-Her-Pail-scaled.webp",
    "createdDate": null,
    "content": "One day, Molly the milkmaid had filled her pails with milk. Her job was to milk the cows, and then bring the milk to the market to sell. Molly loved to think about what to spend her money on.\n\nAs she filled the pails with milk and went to market, she again thought of all the things she wanted to buy. As she walked along the road, she thought of buying a cake and a basket full of fresh strawberries.\n\nA little further down the road, she spotted a chicken. She thought, “With the money I get from today, I’m going to buy a chicken of my own. That chicken will lay eggs, then I will be able to sell milk and eggs and get more money!”\n\nShe continued, “With more money, I will be able to buy a fancy dress and make all the other milkmaids jealous.” Out of excitement, Molly started skipping, forgetting about the milk in her pails. Soon, the milk started spilling over the edges, covering Molly.\n\nDrenched, Molly said to herself, “Oh no! I will never have enough money to buy a chicken now.” She went home with her empty pails.\n\n“Oh, my goodness! What happened to you?” Molly’s mother asked.\n\n“I was too busy dreaming about all the things I wanted to buy that I forgot about the pails,” she answered.\n\n“Oh, Molly, my dear. How many times do I need to say, ‘Don’t count your chickens until they hatch?’”",
    "shortDescription": "One day, Molly the milkmaid had filled her pails with milk. Her job was to milk the cows, and then bring the milk to the market to sell.",
    "level" : "elementary",
    "language" : "english"
  },
  {
    "title": "A Wise Old Owl",
    "source": "unknown",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/A-Wise-Old-Owl.webp",
    "createdDate": null,
    "content": "There was an old owl who lived in an oak tree. Every day, he observed incidents that occurred around him.\n\nYesterday, he watched as a young boy helped an old man carry a heavy basket. Today, he saw a young girl shouting at her mother. The more he saw, the less he spoke.\n\nAs the days went on, he spoke less but heard more. The old owl heard people talking and telling stories.\n\nHe heard a woman saying an elephant jumped over a fence. He heard a man saying that he had never made a mistake.\n\nThe old owl had seen and heard what happened to people. There were some who became better, some who became worse. But the old owl in the tree had become wiser, each and every day.",
    "shortDescription": "There was an old owl who lived in an oak tree. Every day, he observed incidents that occurred around him.",
    "level" : "elementary",
    "language" : "english"
  },
  {
    "title": "The Golden Egg",
    "source": "unknown",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/The-Golden-Egg-e1574853041473.webp",
    "createdDate": null,
    "content": "Once upon a time, a farmer had a goose that laid one golden egg every day. The egg provided enough money for the farmer and his wife to support their daily needs. The farmer and his wife continued to be happy for a long time.\n\nBut, one day, the farmer thought to himself, “Why should we take just one egg a day? Why can’t we take them all at once and make a lot of money?” The farmer told his wife his idea, and she foolishly agreed.\n\nThen, the next day, as the goose laid its golden egg, the farmer was quick with a sharp knife. He killed the goose and cut its stomach open, in the hopes of finding all its golden eggs. But, as he opened the stomach, the only thing he found was guts and blood.\n\nThe farmer quickly realized his foolish mistake and proceeded to cry over his lost resource. As the days went on, the farmer and his wife became poorer and poorer. How jinxed and how foolish they were.",
    "shortDescription": "Once upon a time, a farmer had a goose that laid one golden egg every day. The egg provided enough money for the farmer and his wife to support their daily needs. ",
    "level" : "elementary",
    "language" : "english"
  },
  {
    "title": "The Farmer and the Well",
    "source": "unknown",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/The-Farmer-and-the-Well.webp",
    "createdDate": null,
    "content": "One day, a farmer was looking for a water source for his farm, when he bought a well from his neighbor. The neighbor, however, was cunning. The next day, as the farmer came to draw water from his well, the neighbor refused to let him take any water.\n\nWhen the farmer asked why, the neighbor replied, “I sold you the well, not the water,” and walked away. Distraught, the farmer went to the emperor to ask for justice. He explained what had happened.\n\nThe emperor called on Birbal, one of his nine, and wisest, courtiers. Birbal proceeded to question the neighbor, “Why don’t you let the farmer take water from the well? You did sell the well to the farmer?”\n\nThe neighbor replied, “Birbal, I did sell the well to the farmer but not the water within it. He has no right to draw water from the well.”\n\nBirbal said, “Look, since you sold the well, you have no right to keep the water in the farmer’s well. Either you pay rent to the farmer, or take it out immediately.” Realizing that his scheme had failed, the neighbor apologized and went home.",
    "shortDescription": "One day, a farmer was looking for a water source for his farm, when he bought a well from his neighbor. The neighbor, however, was cunning. ",
    "level" : "elementary",
    "language" : "english"
  },
  {
    "title": "Elephant and Friends",
    "source": "unknown",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/Elephant-and-Friends-scaled.webp",
    "createdDate": null,
    "content": "A lone elephant walked through the forest, looking for friends. She soon saw a monkey and proceeded to ask, ‘Can we be friends, monkey?’\n\nThe monkey quickly replied, ‘You are big and can’t swing on trees like I do, so I cannot be your friend.’\n\nDefeated, the elephant continued to search when it stumbled across a rabbit. She proceeded to ask him, ‘Can we be friends, rabbit?’\n\nThe rabbit looked at the elephant and replied, “You are too big to fit inside my burrow. You cannot be my friend.”\n\nThen, the elephant continued until she met a frog. She asked, “Will you be my friend, frog?”\n\nThe frog replied, “You are too big and heavy; you cannot jump like me. I am sorry, but you can’t be my friend.”\n\nThe elephant continued to ask the animals she met on her way, but always received the same reply. The following day, the elephant saw all the forest animals run in fear. She stopped a bear to ask what was happening and was told the tiger was attacking all the small animals.\n\nThe elephant wanted to save the other animals, so she went to the tiger and said, “Please, sir, leave my friends alone. Do not eat them.”\n\nThe tiger didn’t listen. He merely told the elephant to mind her own business.\n\nSeeing no other way, the elephant kicked the tiger and scared him away. Upon hearing of the brave tale, the other animals agreed, “You are just the right size to be our friend.”",
    "shortDescription": "A lone elephant walked through the forest, looking for friends. She soon saw a monkey and proceeded to ask, ‘Can we be friends, monkey?’",
    "level" : "elementary",
    "language" : "english"
  },
  {
    "title": "When Adversity Knocks",
    "source": "unknown",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/When-Adversity-Knocks.webp",
    "createdDate": null,
    "content": "Asha was getting frustrated and tired of life, so she asked her father what to do. Her father told her to bring an egg, two tea leaves, and a potato. He then brought out three vessels, filled them with water, and placed them on the stove.\n\nOnce the water was boiling, he told Asha to place the items into each pot and keep an eye on them. After 10 minutes, he asked Asha to peel the egg, peel the potato, and strain the leaves. Asha was left confused.\n\nHer father explained, “Each item was placed into the same circumstance, boiling water. See how each responded differently?”\n\nHe continued, “The egg was soft, but is now hard. The potato was hard, but is now soft. And the tea leaves, they changed the water itself.”\n\nThe father then asked, “When adversity calls, we respond in the same manner as they have. Now, are you an egg, a potato, or tea leaves?”",
    "shortDescription": "Asha was getting frustrated and tired of life, so she asked her father what to do. Her father told her to bring an egg, two tea leaves, and a potato.",
    "level" : "elementary",
    "language" : "english"
  },
  {
    "title": "The Needle Tree",
    "source": "unknown",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/The-Needle-Tree.webp",
    "createdDate": null,
    "content": "Once, there were two brothers who lived at the forest’s edge. The oldest brother was always unkind to his younger brother. The older brother took all the food and snatched all the good clothes.\n\nThe oldest brother used to go into the forest in search of firewood to sell in the market. As he walked through the forest, he chopped off the branches of every tree, until he came upon a magical tree.\n\nThe tree stopped him before he chopped its branches and said, ‘Oh, kind sir, please spare my branches. If you spare me, I will provide you with golden apples.’\n\nThe oldest brother agreed but was feeling disappointed with how many apples the tree gave him.\n\nOvercome by greed, the brother threatened to cut the entire tree if it didn’t provide him with more apples. But, instead of giving more apples, the tree showered him with hundreds of tiny needles. The brother fell to the ground, crying in pain as the sun began to set.\n\nSoon, the younger brother became worried and went to search for his older brother. He searched until he found him at the trunk of the tree, lying in pain with hundreds of needles on his body.\n\nHe rushed to him and started to painstakingly remove each needle with love. Once the needles were out, the oldest brother apologized for treating his younger brother so badly. The magical tree saw the change in the older brother’s heart and gifted them with all the golden apples they could need.",
    "shortDescription": "Once, there were two brothers who lived at the forest’s edge. The oldest brother was always unkind to his younger brother. ",
    "level" : "elementary",
    "language" : "english"
  }
]
