[
  {
    "title": "The Winepress",
    "source": "Josef Essberger",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/winepress-300.jpg",
    "createdDate": null,
    "content": "\"You don't have to be French to enjoy a decent red wine,\" Charles Jousselin de Gruse used to tell his foreign guests whenever he entertained them in Paris. \"But you do have to be French to recognize one,\" he would add with a laugh.\n\nAfter a lifetime in the French diplomatic corps, the Count de Gruse lived with his wife in an elegant townhouse on Quai Voltaire. He was a likeable man, cultivated of course, with a well-deserved reputation as a generous host and an amusing raconteur.\n\nThis evening's guests were all European and all equally convinced that immigration was at the root of Europe's problems. Charles de Gruse said nothing. He had always concealed his contempt for such ideas. And, in any case, he had never much cared for these particular guests.\n\nThe first of the red Bordeaux was being served with the veal, and one of the guests turned to de Gruse.\n\n\"Come on, Charles, it's simple arithmetic. Nothing to do with race or colour. You must've had bags of experience of this sort of thing. What d'you say?\"\n\n\"Yes, General. Bags!\"\n\nWithout another word, de Gruse picked up his glass and introduced his bulbous, winey nose. After a moment he looked up with watery eyes.\n\n\"A truly full-bodied Bordeaux,\" he said warmly, \"a wine among wines.\"\n\nThe four guests held their glasses to the light and studied their blood-red contents. They all agreed that it was the best wine they had ever tasted.\n\nOne by one the little white lights along the Seine were coming on, and from the first-floor windows you could see the brightly lit bateaux-mouches passing through the arches of the Pont du Carrousel. The party moved on to a dish of game served with a more vigorous claret.\n\n\"Can you imagine,\" asked de Gruse, as the claret was poured, \"that there are people who actually serve wines they know nothing about?\"\n\n\"Really?\" said one of the guests, a German politician.\n\n\"Personally, before I uncork a bottle I like to know what's in it.\"\n\n\"But how? How can anyone be sure?\"\n\n\"I like to hunt around the vineyards. Take this place I used to visit in Bordeaux. I got to know the winegrower there personally. That's the way to know what you're drinking.\"\n\n\"A matter of pedigree, Charles,\" said the other politician.\n\n\"This fellow,\" continued de Gruse as though the Dutchman had not spoken, \"always gave you the story behind his wines. One of them was the most extraordinary story I ever heard. We were tasting, in his winery, and we came to a cask that made him frown. He asked if I agreed with him that red Bordeaux was the best wine in the world. Of course, I agreed. Then he made the strangest statement.\n\n\"'The wine in this cask,' he said, and there were tears in his eyes, 'is the best vintage in the world. But it started its life far from the country where it was grown.'\"\n\nDe Gruse paused to check that his guests were being served.\n\n\"Well?\" said the Dutchman.\n\nDe Gruse and his wife exchanged glances.\n\n\"Do tell them, mon chéri,\" she said.\n\nDe Gruse leaned forwards, took another sip of wine, and dabbed his lips with the corner of his napkin. This is the story he told them.\n\nAt the age of twenty-one, Pierre - that was the name he gave the winegrower - had been sent by his father to spend some time with his uncle in Madagascar. Within two weeks he had fallen for a local girl called Faniry, or \"Desire\" in Malagasy. You could not blame him. At seventeen she was ravishing. In the Malagasy sunlight her skin was golden. Her black, waist-length hair, which hung straight beside her cheeks, framed large, fathomless eyes. It was a genuine coup de foudre, for both of them. Within five months they were married. Faniry had no family, but Pierre's parents came out from France for the wedding, even though they did not strictly approve of it, and for three years the young couple lived very happily on the island of Madagascar. Then, one day, a telegram came from France. Pierre's parents and his only brother had been killed in a car crash. Pierre took the next flight home to attend the funeral and manage the vineyard left by his father.\n\nFaniry followed two weeks later. Pierre was grief-stricken, but with Faniry he settled down to running the vineyard. His family, and the lazy, idyllic days under a tropical sun, were gone forever. But he was very happily married, and he was very well-off. Perhaps, he reasoned, life in Bordeaux would not be so bad.\n\nBut he was wrong. It soon became obvious that Faniry was jealous. In Madagascar she had no match. In France she was jealous of everyone. Of the maids. Of the secretary. Even of the peasant girls who picked the grapes and giggled at her funny accent. She convinced herself that Pierre made love to each of them in turn.\n\nShe started with insinuations, simple, artless ones that Pierre hardly even recognized. Then she tried blunt accusation in the privacy of their bedroom. When he denied that, she resorted to violent, humiliating denouncements in the kitchens, the winery, the plantations. The angel that Pierre had married in Madagascar had become a termagant, blinded by jealousy. Nothing he did or said could help. Often, she would refuse to speak for a week or more, and when at last she spoke it would only be to scream yet more abuse or swear again her intention to leave him. By the third vine-harvest it was obvious to everyone that they loathed each other.\n\nOne Friday evening, Pierre was down in the winery, working on a new electric winepress. He was alone. The grape-pickers had left. Suddenly the door opened and Faniry entered, excessively made up. She walked straight up to Pierre, flung her arms around his neck, and pressed herself against him. Even above the fumes from the pressed grapes he could smell that she had been drinking.\n\n\"Darling,\" she sighed, \"what shall we do?\"\n\nHe badly wanted her, but all the past insults and humiliating scenes welled up inside him. He pushed her away.\n\n\"But, darling, I'm going to have a baby.\"\n\n\"Don't be absurd. Go to bed! You're drunk. And take that paint off. It makes you look like a tart.\"\n\nFaniry's face blackened, and she threw herself at him with new accusations. He had never cared for her. He cared only about sex. He was obsessed with it. And with white women. But the women in France, the white women, they were the tarts, and he was welcome to them. She snatched a knife from the wall and lunged at him with it. She was in tears, but it took all his strength to keep the knife from his throat. Eventually he pushed her off, and she stumbled towards the winepress. Pierre stood, breathing heavily, as the screw of the press caught at her hair and dragged her in. She screamed, struggling to free herself. The screw bit slowly into her shoulder and she screamed again. Then she fainted, though whether from the pain or the fumes he was not sure. He looked away until a sickening sound told him it was over. Then he raised his arm and switched the current off.\n\nThe guests shuddered visibly and de Gruse paused in his story.\n\n\"Well, I won't go into the details at table,\" he said. \"Pierre fed the rest of the body into the press and tidied up. Then he went up to the house, had a bath, ate a meal, and went to bed. The next day, he told everyone Faniry had finally left him and gone back to Madagascar. No-one was surprised.\"\n\nHe paused again. His guests sat motionless, their eyes turned towards him.\n\n\"Of course,\" he continued, \"Sixty-five was a bad year for red Bordeaux. Except for Pierre's. That was the extraordinary thing. It won award after award, and nobody could understand why.\"\n\nThe general's wife cleared her throat.\n\n\"But, surely,\" she said, \"you didn't taste it?\"\n\n\"No, I didn't taste it, though Pierre did assure me his wife had lent the wine an incomparable aroma.\"\n\n\"And you didn't, er, buy any?\" asked the general.\n\n\"How could I refuse? It isn't every day that one finds such a pedigree.\"\n\nThere was a long silence. The Dutchman shifted awkwardly in his seat, his glass poised midway between the table and his open lips. The other guests looked around uneasily at each other. They did not understand.\n\n\"But look here, Gruse,\" said the general at last, \"you don't mean to tell me we're drinking this damned woman now, d'you?\"\n\nDe Gruse gazed impassively at the Englishman.\n\n\"Heaven forbid, General,\" he said slowly. \"Everyone knows that the best vintage should always come first.\"",
    "shortDescription": "\"You don't have to be French to enjoy a decent red wine\"",
    "level" : "intermediate",
    "language" : "english"
  },
  {
    "title": "Bad blood",
    "source": "Clive Lane",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/RS8535_GettyImages-90247068-low.jpg",
    "createdDate": null,
    "content": "David and Emma looked at each other across the table. The young couple were happy: the food was delicious, the light from the candles was soft and the music was perfect. \n\nDavid looked at Emma's beautiful smile. All the pain of his last break-up disappeared. All his doubts and fears about love had gone. His hand reached out and touched hers. \n\n'I want to ask you something.' David searched her eyes. Could she guess what was coming? \n\nHer smile made him feel brave. She held his hand. 'Don't worry. Whatever it is, I'll probably say yes!' \n\nHe felt so excited. He was about to ask the most important question of his life.\n\nFrom the corner of the restaurant, a strange man watched them. He sat very still at his table. He held a menu but he wasn't reading it. Instead, his cold eyes looked only at the young couple. \n\nBack at their table, David suddenly felt nervous. \n\n'Excuse me,' he said to Emma. He pushed his chair back and went to the toilet. As he looked in the mirror, he told himself: 'Come on, David, come on! You can do this, mate! She's crazy about you!'\n\nFeeling ready, he went out of the bathroom. He almost walked into the extremely tall man who was waiting by the door. The man's eyes were a cold, bright blue. His face was pale with a sharp, pointed nose and thin, pale lips. \n\n'Oh, sorry!' said David. \n\n'Which one?' the man hissed. He spoke with a strong and strange accent. David had never heard that accent before.\n\nFor a moment, David was confused. Then he realised what the other man meant.\n\n'Oh … this one!' said David, helpfully. 'This is the men's toilet!'\n\nDavid went back into the restaurant. He reached for the ring in a box in his pocket. It was time to ask her! \n\n...\n\nThe taxi ride home was wonderful. The happy couple discussed their future life together. They shared their sweet feelings about each other. \n\n'The night I asked you to marry me!' said David. \n\n'The night I said yes!' replied Emma. \n\n'Just think, our whole lives together!' \n\n'Sharing, caring, …' he began.\n\n'... loving, giving!' Emma finished his sentence.\n\nThey smiled at each other in loving excitement. \n\n'You are so wonderful!' said David.\n\n'And you're absolutely beautiful!' said Emma. 'I've never met anyone so lovely and kind! I'm so happy I could sing!' \n\nThey entered their block of flats, holding hands. A tall man watched them from the shadows. \n\n'Which one?' he asked himself.\n\nHe watched the building. He was waiting for a light to come on to show him which flat was theirs. One minute passed … two … there it was! The light went on in a third-floor window. He saw Emma for a moment as she closed the curtains. \n\nHow many times had he stood on a corner like this? How many victims had he watched? Many corners! Many victims! His pale lips formed a thin smile. He moved out of the shadows to the door and pressed the buttons for every flat. The vampire was always pleased when people lived in flats. Sooner or later someone always let you in. Silly humans! They thought you were someone's pizza delivery. It was a kind of invitation, and that was all he needed to enter a home. \n\nHe climbed the stairs to the third floor and walked down the hall. He didn't make a sound. He could hear the young couple laughing and talking. He put his ear against the door. He could hear what they were saying and he was happy. Young love made the sweetest blood. It was so full of life and energy.\n\n'I feel as if I'm in a film,' she was saying.  \n\n'More like a dream,' he replied.\n\n'Yes, a dream. How lucky we are!' \n\nGuess who I'll be dreaming about tonight?' he said.\n\n'Who? Who?' \n\n'Her hair smells of roses! She's like an angel!'\n\nTheir dream was about to become a nightmare, the listening vampire thought. Suddenly, he opened the door and stood there, showing his sharp teeth. The couple screamed and then held each other in terrified silence. The vampire could smell and taste their fear. This was how he liked it. Fear also made the blood sweeter.\n\n'There's my wallet! On the table, there! Take it!' said David. 'Take anything you want!'\n\n'I will take anything I want!' the vampire replied. \n\n'Fine! Fine! We won't stop you, I promise!' David cried.\n\n'You won't stop me. I promise!' replied the vampire.\n\nThe light shone on the sharp teeth. A terrible thought came to David and Emma at the same time. \n\n'Look at his teeth! Is he ... ?'\n\n'A vampire!!'\n\n'Which one?' the vampire hissed. 'It can be … only one!'\n\nThe couple's eyes were big and afraid. Their mouths open in horror. They held each other's hands and their stomachs filled with fear. \n\n'Already tonight,' continued the vampire, 'I have drunk from three. One more ... then … I can … sleep … and feel young again.'\n\nThe vampire moved towards them. Instinct made David step in front of Emma to protect her. Emma gratefully held onto his back. \n\nThe vampire wasn't in a hurry. He had plenty of time. Who should he attack? he asked himself. Which one? \n\n'Thank you,' Emma said quietly in David's ear, 'for what you're doing for me.'\n\n'Of course, my love. I'm here to protect you.' He felt proud as he said the words. He could fight this vampire. All he needed was a piece of wood or something to push through the heart. He looked around for something ...\n\n'You're so brave to offer yourself,' continued Emma. \n\n'Sorry?' asked David. 'What are you talking about?'\n\n'Oh!' said Emma. 'I just thought that with your love for me and everything …'\n\nDavid and the vampire looked at each other.\n\n'Now, listen, Emma. There is no doubt about my love for you!'\n\n'Really?' she replied. She didn't believe him. \n\n'But you can't expect me to just give him my life!'\n\n'I wasn't saying you should!' she said. 'It's just one of our options, that's all!'\n\n'Well, think of another one!' he shouted. 'Why don't you offer yourself to him to save me!'\n\nThe atmosphere in the room had certainly turned ugly. The vampire was not pleased that the fear and love were now silly, selfish arguments.\n\nEmma was very angry. 'I hope you're joking!'\n\n'Let's see how strong your love is!' \n\n'What a horrible man!' \n\n'What about the woman I was planning to marry?! Offering me to a vampire like a bone to a dog!'\n\n'You said my hair smells of roses!' she cried. \n\n'All right, all right! Relax!' David was a little embarrassed to be having this argument in front of a stranger. \n\n'I'm an angel, you said!' she carried on shouting.\n\n'MUST … DRINK!' shouted the vampire angrily as he came even closer. He wanted to make a quick kill. Then he could get away from these terrible people as soon as possible. \n\nHis eyes opened wider and his teeth were bared. 'WHICH ... ONE?' \n\n'HER!' David pointed at his future wife. \n\n'HIM! HIM!' screamed Emma in anger. 'Please, HIM!' \n\nThe vampire approached David. \n\n'She's younger! Sweeter!' said David. \n\nThe vampire turned to Emma. \n\n'He's bigger! There's more of him!' She pointed at David. \n\nSuddenly the vampire felt tired. He had been killing for many centuries. Listening to them was depressing. How could he feel good by drinking the blood of either of these disgusting creatures? \n\nHe looked down at their terrified faces and shouted, 'BAD BLOOD!' \n\nAnd with that, he disappeared into the night air and left Emma and David alone together. Together, as they had promised, for the rest of their lives.",
    "shortDescription": "When a vampire visits a happy young couple, will true love save their lives?",
    "level" : "advanced",
    "language" : "english"
  },
  {
    "title": "First star I see tonight",
    "source": "Andrew Leon",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/RS8414_GettyImages-1189211944-low_0.jpg",
    "createdDate": null,
    "content": "Dr Tomas Streyer looked around the control room at his team of scientists and engineers. He was excited and frightened but he tried to seem calm. In a few minutes, they might start to discover something amazing: how the universe began.\n\nHe looked out of the window at the beautiful blue summer sky and tried to breathe slowly.\n\n'Ready,' he said. He pressed the first button and the complicated computers and machines came to life.\n\n'Set,' he said. He pressed the second button and switched on the large particle accelerator that lay under the towns and fields of Switzerland. \n\n'Go,' he said. And, at exactly twelve o'clock, he pressed the final button.\n\nFor a second, he felt as if he was blind, because everything went completely black. Tomas shouted in shock, but the lights were already on again. That was not part of his plan. He had no idea what had just happened.\n\n'Everybody, check the systems!' he ordered. But nothing seemed to be wrong with them. The particle accelerator was working perfectly.  \n\n'Tomas,' said his assistant. 'Look outside.' She sounded afraid.\n\nThe perfect summer's day of five minutes ago had gone. Instead, the sky was darker than the blackest night. But that wasn't the worst thing. The sun wasn't there, and the moon and stars were also gone.\n\nPeople were shouting and screaming. They started calling their families on the telephone because they were afraid they had all gone too. Tomas felt as if it was hard to breathe, but he counted to ten and tried to breathe slowly. He sat at the main computer and started reading the information and numbers from his experiment. But he couldn’t find anything to explain what was happening. He ran out of the exit with the rest of his team until they were all outside the building. \n\nEveryone else in the building was outside, frightened and confused. They were using the screens and lights on their mobile phones to see better. Several people got in their cars and turned on the lights. They drove to the entrance to make a small area of light for everybody to stand together. The street lights turned on, but most people were still afraid. \n\nThen, almost twenty minutes after Tomas had started the particle accelerator, the sun was in the sky again. It was warm and yellow, and the black sky turned blue again. Everyone started laughing and dancing around, and Tomas felt as if he could breathe normally again. \n\nBut later, hours later, when the real night began, no one was happy. Because, although the moon rose again, there were no stars in the sky at all.\n\n…\n\nNo one wanted to know what Tomas' work was actually about. They didn't care what the particle accelerator was for. What did that matter? All they cared about was what had happened after he turned the machine on. He had stolen all the stars – or that's what the newspapers said. And when they made him go to the International Criminal Court, they charged him with stealing the stars. \n\nTomas said, 'I'm not guilty.'\n\n'Well, if you didn’t steal the stars, Dr Streyer,' said the lawyer for the prosecution, 'what did you do?'\n\n'If you're asking about my work,' said Tomas, 'we didn't do anything. We showed that the machine was working, that's all.'\n\n'Taking the stars from the sky seems like nothing to you?' The lawyer looked around at the people in the court. 'No one here would think it's nothing. No one in the world would think it's nothing.'\n\n'That's not what I meant,' said Tomas. 'But I can tell you this: when the machine started, there were suddenly no photons in the test room.'\n\n'What? Photons? We aren't all scientists here! Speak simple English, Dr Streyer!'\n\n'Light,' said Tomas. 'For just a moment it was as if there was no light in our laboratory. Then we saw it was also dark outside … until the light became normal again.'\n\n'Normal, Dr Streyer? It wasn't normal when …' – the lawyer checked his notes – '… the sun went out for exactly sixteen minutes and forty seconds. Perhaps we can say the rest of the day was normal. But the night hasn't been normal ever since, has it?'\n\nTomas looked sad. 'I know. But you must believe me. I didn't do anything that could have taken the stars from the sky!'\n\n'So are you saying you didn't steal the stars from us?' said the lawyer.\n\n'No, I didn't steal them,' Tomas said.\n\n'You just made it so that we can't see them any more.'\n\nAfter a long pause, Tomas spoke. 'Yes,' he said.\n\n'How is that any different?' the lawyer asked.\n\nTomas didn't have an answer, not one anyone would understand anyway. And if they understood it, they wouldn't believe him. He had an idea, but it would take years to prove it.\n\nInstead, he changed his mind and said, 'I'm guilty.'\n\n…\n\nNow the world could blame someone for what it had lost. But there was no point sending Tomas to prison for years. It wouldn't change anything. Instead, they designed a punishment especially for him. \n\nThey sent Tomas to work at the Extremely Large Telescope in Paranal in Chile. Nobody used the telescope now. No tourists came to these high mountains to see the edges of our galaxy. No scientists asked for money to study the empty sky. All that passed through the night sky was the lonely moon and a few planets. Looking up made people feel bad.\n\nTomas thought it was fair that they punished him. And the job was almost the same as prison because he was completely alone. After a few years, the world forgot about him. Or, at least, everyone decided to leave him alone. Every evening he watched the sun go down. The red ball was gone exactly eight minutes and twenty seconds after it actually went behind the Earth. Tomas was almost happy to know that the laws of physics remained the same. Light still travelled at the same speed as it had always travelled. He hoped it meant he hadn't changed the universe that much. We know there is a speed light travels at, he thought, so perhaps the dark travels at the same speed. \n\nOf course, there was no way to prove his idea. Not yet. And, alone in the mountains, Tomas had nobody to share his idea with anyway.\n\n…\n\nHigh in the mountains of Chile, Tomas continued to watch the night sky. With the enormous telescope, he looked at the same place in the empty sky every night, even though there was nothing to see. And each day as the sun went down, he thought of the song his parents sang to him as a child:\n\n \n\nStar light, star bright,\nFirst star I see tonight,\nI wish I may, I wish I might,\nHave the wish I wish tonight.\n\n \n\nFor 1,596 black nights – nearly four and a half years – there was no change to the night sky. But that was OK. It didn't mean his idea was wrong. Tomas thought about the darkness he had created. He imagined it like a wave that had passed the sun. Now, maybe, it was continuing out towards the edge of our galaxy and further, to the stars. It would take 1,596 nights to pass the nearest star. It would take 1,596 more nights for that star's light to come back to Earth ... If the wave was real, of course. If his ideas were correct. If he was wrong, the stars were really gone forever. \n\n…\n\nAnd then one night 1,596 nights later, almost nine years after that terrible day, Tomas looked up from his telescope. There was Alpha Centauri twinkling back at him from the night sky.\n\nThe first star.\n\nHe felt tears in his eyes and he made a wish. And he imagined millions of other people were making their wishes too.",
    "shortDescription": "When his physics experiment goes wrong and all the stars disappear, the whole world blames Dr Tomas Streyer. Are the stars gone forever?",
    "level" : "advanced",
    "language" : "english"
  },
  {
    "title": "Frank's last case",
    "source": "Clive Lane",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/RS8536_GettyImages-1175901032-hig.jpg",
    "createdDate": null,
    "content": "Sergeant Frank Spike sat behind his desk and looked out of the window. Outside, cars moved slowly in the cold, grey rain. He looked down at the grey hairs on his arms. His round stomach pushed against the desk. This was his final month before he retired from the police. For Frank, his last day couldn't come too soon. \n\nFrank felt angry as he thought about the money he would get when he retired. It wasn't enough money to pay for a short holiday on the cold and rainy east coast of England where he lived. It certainly wouldn't pay for his dream holiday – a luxury, round-the-world cruise.\n\nJust then, Inspector Spencer came to Frank's desk. Spencer had perfect white teeth and he was always smiling. Three years earlier, Spencer had been promoted. Now he was an inspector at the young age of forty. Frank wasn't so lucky. He had worked for the police for forty years and he was still a sergeant. Frank knew he wasn't as handsome or as friendly as Spencer, sorry, Inspector Spencer. But Frank was a better policeman. Frank had 'a nose for crime' and Spencer didn't. That 'nose' meant Frank could think like a criminal and solve the most difficult crimes. As a result, the younger man often asked for Frank's help. In fact, it was the only time Spencer spoke to him.\n\n'Hey, Frank, can I ask you something?' asked Spencer.\n\nFrank wasn't surprised. \n\n'Do you know who the Babbingtons are?' Spencer continued.\n\nEveryone knew who the Babbingtons were. Ronald Babbington was the super-rich owner of Babbington Oil, and his wife Tabitha was a model. Together they loved showing how rich they were. They often appeared in magazines like Hello!, with their beautiful house and their collection of cars. Last month, Ronald had bought an enormous diamond for Tabitha. The diamond sat in a large gold and glass case at the end of a long, red carpet. There was an alarm system to keep it safe.\n\nSpencer continued to explain. \n\n'Someone told us about a plan to steal the Babbington diamond!'\n\nFrank tried to look as though he was surprised.\n\n'Peggy, the owner of the Dog and Duck pub, heard two local criminals making the plan,' Spencer said. 'She asked us to keep her name secret, of course.'\n\n'OK,' Frank said. He waited for the question he knew would come.\n\n'So?' Spencer asked. 'What should we do? They haven't committed a crime yet.' \n\nFrank looked out of the window. He remembered his retirement money. He didn't want to be alone in his retirement, but the money wouldn't even be enough to buy a cat.\n\nThe sound of a car outside brought him back to the conversation with Spencer. He put his fingers together under his chin to look as if he was thinking. In fact, he was, but not in the way Inspector Spencer expected.\n\n'Listen, do this the clever way,' said Frank. 'Let them steal the diamond. If you catch them with the diamond, you can arrest them, no problem.'\n\n'But, Frank,' said Spencer, 'we would need the Babbingtons to agree. And there are laws against trying to trick criminals like that, you know!' \n\n'That's why you let them steal the diamond. Then, as if by chance, you stop them for driving too fast as they escape. Search the car and find the diamond. You don't need to tell anyone that we knew about their plan. And they'll go to prison.' \n\n'Hmmmm. OK.' Spencer was uncomfortable with the idea Frank was suggesting. But he knew it would work. \n\nFrank continued, 'Of course, the officer who arrests them needs to be reliable.'\n\nSpencer understood immediately. \n\n'Are you sure you want to do it, Frank? It could be dangerous.'\n\n'I'll take two young officers with me. But, yes, of course I want to do it.'\n\n'Why?' asked Spencer. 'You're going to retire soon! Don't you want to take it easy?'\n\n'That's exactly why I want to do it,' Frank replied. 'My last case will be my best!'\n\n*****\n\nA few days later, Frank visited the Dog and Duck pub after work. \n\n'Did you get it?' he asked Peggy as she gave him his drink. \n\n'Yes. I have now got a perfect copy of the Babbington diamond,' she said. 'I told the glassmaker I was a big fan of the Babbingtons. And I said that my boyfriend wouldn't buy me a diamond of my own.' \n\n'You need a new boyfriend,' said Frank. 'If I were your boyfriend, I'd buy you a diamond ring and take you on a long luxury cruise.'\n\n'Oh, really?' she said and smiled.\n\n*****\n\nFrank was sitting in the back seat of the police car. The car was hidden in a small road next to the Babbington house. In the front seats were two strong, young police officers. \n\nAt 23.30, a message came in on the police radio. The thieves, a man and a tall woman, had met outside the Dog and Duck pub. At 23.37, they got into a car. The man started the car and drove away from the pub. \n\nAt midnight, the thieves passed the hidden police car on the way to the Babbingtons' house. At 00.13, the woman climbed over one of the garden walls. A second hidden police team watched her climb over, while the man waited in the car.  \n\nAt 00.20, the woman climbed back over the wall. She had an excited smile on her face. She ran back to the car. Smiling, the man waited for her to jump in and then they drove away. \n\n*****\n\nAlmost immediately, the thieves passed Frank's car. The young police officer in the driver's seat switched on the blue lights and followed them. \n\nInside the car, the thieves were afraid.\n\n'What are they doing here?' the man shouted. 'You said you turned off the alarms!'\n\n'Relax, I did,' she replied. 'Remember, the police don't know what we've done. Just be normal! We can walk away from this with the diamond.'\n\nThe man stopped the car and opened his window. \n\n'Is there a problem, officer?' he asked. His face was red and shiny because he was so nervous. \n\n'You were speeding. We'll need to give you a ticket. Can you both get out of the car, please?' \n\nThe man still looked nervous. One officer wrote the speeding ticket and the other stood close in case they ran away. Frank began to search the car.\n\n'Hey! What's he doing?' the woman said. But she knew the game was over. \n\nFrank breathed heavily as he started looking under the seats. His hand felt something smooth, hard and cold under the front passenger seat. The Babbington diamond! He took the diamond and put it in his jacket pocket. At the same time, with his other hand, he took something very similar out of his trouser pocket. He held it up. \n\n'OK, you two!' he said. 'You are under arrest for stealing this diamond!' \n\n****\n\nWhile the young police officers arrested the criminals, Frank held the evidence up for everyone to see. In the light from the moon, it shone every colour.  \n\n'Wow!' said one of the young police officers. 'I've never seen a real diamond up close.' \n\n'Imagine if someone gave you that as a present!' said the other. \n\n'Just imagine,' Frank agreed. He carefully put it into an evidence bag. Half an hour later, back at the station, he gave it to Spencer. Spencer took it from him carefully, as if it was a new baby. \n\n*****\n\nFive weeks later, Frank was sitting in his new armchair and drinking a glass of the best champagne. His expensive new cat sat at his feet. \n\nHe picked up the local newspaper. The two thieves had got six years in prison. The photo in the newspaper was of the Babbingtons. They were standing next to the diamond inside its new, extra-strong glass case. Frank looked closer at the photo of the diamond. \n\nOnly an expert would notice anything strange about the Babbington diamond. And only if they saw the diamond up close. \n\nFrank put the newspaper down and picked up one of the travel magazines on his beautiful new coffee table. \n\n'Peggy?' he said. 'Would you like to go to the Bahamas or the Maldives?'\n\nPeggy put down her own champagne glass. A small diamond ring on her finger shone in the light. 'Why not both?' she smiled. \n\n'I did promise you a long cruise,' he said. \n\n'You did!' she replied. 'I'm so glad I called you first when I heard them planning to steal the diamond.'\n\n'Me too, Peggy,' he said. 'Me too.'\n\nLife now he had retired was a wonderful thing after all. ",
    "shortDescription": "Sergeant Frank Spike is not a successful police officer. But he has 'a nose for crime'. Will his last case be a success?",
    "level" : "advanced",
    "language" : "english"
  },
  {
    "title": "Love me, love me not",
    "source": "Nicola Prentis",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/RS8533_GettyImages-1189531270-low.jpg",
    "createdDate": null,
    "content": "Kate looked around the room at the other people: ten men and ten women all around the same age. \n\n'Thank you for coming today and offering your time to help with our research! Limeren, the medicine we're testing, is in the final stage of testing. Previous human trials have shown us that Limeren is completely safe ...'\n\nKate stopped paying attention. She'd read the information the medical research company had sent her, so she knew that Limeren had already been approved for sale and that they were not testing to see if there were side effects. She didn't know any of the other people in the group. She guessed that none of them had jobs either or they wouldn't be earning money by testing medicine. But otherwise it was impossible to know if she had anything in common with any of them. She hoped so, or four days in the research centre would feel like a very long time.\n\n'... as side effects, we know that some people experience stronger emotions and a feeling of general happiness,' the head researcher said. 'We'll be interviewing each of you and doing tests during the day and night. So if you can all sign the forms, we can start.'\n\nKate signed her form without reading the information. Hopefully, this was going to be a very easy way to make money. \n\n'I hope the food's better than last time,' said the guy sitting next to her as he gave in his form. \n\nKate smiled. \n\n'I'm Michael.' \n\n'Kate,' she said. 'Have you been here before?'\n\n'I do these trials as often as they'll let me!' He laughed. 'It's such an easy way to make money!' \n\nShe smiled back. Here was someone she had something in common with.\n\n...\n\nA few hours later, Kate was eating dinner. She had taken her second Limeren tablet before dinner. She was feeling really relaxed. Maybe it was the vitamins, or maybe it was just because she had so much free time and there was nothing she needed to do. There were books to read, films to watch and even board games and puzzles. At home, she had to send out job applications. Or she had to go to stressful job interviews. After more than twenty applications she still didn't have a job. \n\nShe looked up and saw Michael smiling at her. 'Do you want to play a board game?' he asked. His eyes were really dark brown, Kate thought. She hadn't noticed that earlier. She felt her cheeks go red. 'Sure,' she replied. 'But I like to win,' she warned. \n\n'Perfect,' he said. 'Me too!' \n\nWas it her imagination or did his cheeks look a bit pink too? \n\n...\n\nFor the next two days, Kate and Michael spent hours and hours playing games, chatting and watching films. \n\n'I feel as if I've known you for months, not days,' she said. She already knew he lived nearby, that he was a student studying for his PhD and that he had dimples in his cheeks when he smiled and a cute way of putting a pen behind his ear when he was reading. She wasn't sure, but she thought he was trying to sit next to her for meals and spend time with her whenever he could. Or maybe she was the one who was always looking for him.\n\n'So, do you think you're feeling any side effects?' he asked her one evening. They were sitting on the sofa, watching a film. Michael's knee was almost touching her leg, and if his hand moved just a little, it would be touching hers. Her heart beat faster and all she could think about was being near enough for his skin to touch hers. Her face was red again, she knew it.\n\n'Any what?' she asked, trying to concentrate on their conversation instead. \n\n'The side effects of Limeren that they told us about at the presentation,' he said, moving his hand away. Her skin immediately felt cold, as if his hand had been making the air between them warm. \n\n'Oh, I wasn't really listening,' she said. 'We still get paid anyway, don't we?'\n\nAnd then he did it. He moved his hand so that it covered hers. A nice feeling travelled all the way through her fingers and across her skin. She turned her hand over and held his hand. He smiled and moved his face towards hers.\n\n'Can everyone come and get their next Limeren, please?' called a nurse. Michael dropped her hand and followed the rest of the group to the nurse's room. Kate couldn't remember ever feeling so happy.\n\n...\n\n'Thank you everyone for taking part. You're now free to go,' the head researcher said the next morning as the trial ended. 'Any side effects will disappear over the next few days. If you have felt any strong feelings, and happiness, those feelings will decrease. Fortunately, we don't expect anyone to become depressed. However, we will keep in touch with all of you in the next few days to make sure everything is fine.'\n\n'We can have our first date now,' Michael said to Kate. 'Breakfast?'\n\nOver breakfast, they talked and talked. Kate knew she was in love. It was stupid, but it was true. Michael said it first. \n\n'I can't believe I met you. I've never felt like this about anyone before.'\n\n'This does feel amazing,' Kate said. But she had been worried about something since the beginning of the trial. She hadn't wanted to think about it but now she had to ask him a serious question.\n\n'You don't think …?'\n\n'What?'\n\n'What if it's the Limeren making us feel like this? What was it he said about strong feelings?' \n\n'There's only one way to find out!' he said. 'If you don't want to be my girlfriend any more after a few days, we'll know it was just the Limeren.'\n\nShe smiled at the word 'girlfriend.' 'Maybe your side effects will go away first!' \n\n'Maybe!' He laughed. 'But I don't think so. This feels real to me.'\n\n'Me too,' she said. \n\n...\n\nFour months later\nA few months later, Kate was thinking about the beginning of their relationship. She had to admit, nothing could ever be as perfect as those first days together. Real life had to start again. She got a job a few days after the trial ended. Michael went back to the library and his books and research projects. She didn't have to worry about money any more but they could no longer spend all day, every day together. They were no longer at that exciting stage of falling in love. But they saw each other when they could and they met each other's parents. Everyone expected them to get married. When he finally asked her to marry him, she felt that old excitement again.\n\n...\n\nThree years later\n'I really don't have time for this!' Kate shouted. She hated doing the weekly shopping. Why couldn't he do it? \n\n'Fine, I'll go then,' she said, closing the door hard so that it made a loud noise.\n\nKate felt as if these kinds of arguments were happening more often. As she walked around the supermarket, she thought about how they'd been before, when they were in love. 'Can it ever feel like that again?' she wondered. \n\nWalking into the health section, she recognised a word on a box of medicine. Limeren. The vitamin's name reminded her of a special time, a time when she was really crazy about Michael. She picked up a box and put it in her basket. \n\n...\n\nWhen she got home, Michael was already in bed so she ate dinner alone, taking her Limeren with a big glass of water. The next morning, she woke up early as usual, but instead of jumping straight in the shower, she joined Michael downstairs for breakfast.  \n\n'Good morning!' she said. To her surprise, she suddenly wanted to kiss him on the cheek. So she did, and sat down next to him at the table. He was eating in front of a big pile of books, looking cute with a pen behind his ear. 'What are you doing?'\n\n'I'm applying for money for my next research project,' he said. \n\n'Oh, good luck! What's the project about?' \n\nAfter breakfast, she thought how nice it had been to see him talking about something he cared about. She'd forgotten how cute his dimples were when he smiled, she thought. Or maybe she hadn't seen him smile much recently. Anyway, she decided to have breakfast with him every day, since it had been such a lovely start to the day. It couldn't hurt to make a bit more effort, could it?\n\n...\n\nTwo years later\nThe baby hadn't stopped crying for two hours, but now her little face was peaceful as she slept. Kate felt annoyed. Where was Michael? She went downstairs and found him filling bottles with milk for the baby.\n\n'Well done!' Michael said. 'That didn't sound easy.' \n\n'No!' she said angrily. 'It isn't!'  \n\n'You're doing an amazing job,' he said. 'OK, so, I've washed all the clothes, made your lunch for later and I'm going to come home early this afternoon so that you can have some time for yourself.' \n\nKate managed to smile and say thank you. He really was being very sweet, even if she was too tired to feel grateful or to be nice back. As soon as he had left for work, she picked up the box of Limeren. By the time he came home, Kate felt able to smile back when he smiled at her. \n\n \n\nOne year later\nKate was putting clothes away while the baby slept. She picked up one of Michael's favourite jumpers and held the soft material next to her cheek. She missed him and he had only been out an hour. Putting it back, she noticed something hard under the rest of the jumpers in the drawer. It was boxes and boxes of Limeren. \n\nThey weren't hers! She was shocked to see these boxes. She took Limeren every day, it was true, but Michael? She thought of Limeren as an easy way to those feelings she'd always had for Michael. And it was working. Every day she felt madly in love with her wonderful husband. Everyone said marriage was hard work, but she just didn't have time or energy for the job of marriage as well as her part-time job and a young baby. When she took Limeren, she made more effort to do small things that made their life together enjoyable. If he did something nice for her, she said thank you, but most of all she actually felt grateful. If he wore a new shirt or his hair looked good, she told him he was handsome. She asked him about his day and remembered things that were important to him. She'd seen nothing wrong with doing this. Until now, that is. Now she knew why he had always been so good at doing those same things for her. It was all fake!\n\nInstead of smiling at Michael when he got home, she was angry. Clearly the Limeren only had a limited ability to make everything perfect because nothing felt perfect right now.\n\n'What are all these?' she asked. She pointed to the Limeren packets she'd taken from the drawer and put on the kitchen table. \n\nMichael moved closer and tried to read the small writing on the boxes. 'They're vitamins, aren't they?'\n\n'Don't act as if you've got no idea why I'm asking!' said Kate, even more angry. 'These boxes,' she said, picking one of the packets up, 'are our relationship.'\n\n'Oh!' he said. 'It's Limeren!' \n\n'Yes, it's Limeren,' she said. 'I know exactly what they are.'\n\nHe looked confused. 'So why are you asking me what they are? I remember the name now you've said – from the place we met, right? – but I've not taken those for years.'\n\n'What?' \n\n'I just ... I don't know. It's better to get vitamins from fruit and vegetables, isn't it?' he said. 'The research company sent us boxes and boxes of them years ago, but I put them away somewhere and forgot to throw them away. We eat a healthy enough diet so there's no need to take vitamins.'\n\n'What about ...' She felt her voice getting louder and louder, but also something made her feel less sure about the words she planned to say. Her idea sounded stupid. 'What about the falling in love part? The side effects! You're always so wonderful, the perfect husband. And now I know why!'\n\n'Er ... thanks?' He laughed. 'I know they told us there were some side effects, but we were just joking when we said we fell in love because of the medicine, weren't we? Also,' he added, turning the box over in his hands, 'they must have changed the ingredients or something because it doesn't say anything on the box about side effects. See?' He held it out for her to look. 'Maybe they changed the recipe after we did that trial. Who knows?'\n\nHe gave her a big hug. 'This perfect husband is all natural, don't worry.'\n\nHe went upstairs to kiss the baby and then she heard him in the kitchen as he started to make dinner. She looked carefully at the boxes and it was true. There was nothing on the box about side effects, or even on the information inside. They were just vitamins after all. Limeren wasn't an easy way to love and it never had been.",
    "shortDescription": "Two people fall in love. But is their experience real? Or is it just an effect of the medicine they're taking?",
    "level" : "advanced",
    "language" : "english"
  },
  {
    "title": "The devil's in the details",
    "source": "Nicola Prentis",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/RS8413_GettyImages-95504815-low_0.jpg",
    "createdDate": null,
    "content": "Someone knocked at her door just as Victoria was about to leave her flat. It was strange because she hadn't heard the lift or anyone on the stairs. She quickly tried to put on her other shoe and nearly fell over. There were many unopened letters – probably asking for money – on the floor. She was late to work for the third time this month and now she had a visitor. Great, she thought.\n\nShe opened the door and tried to smile in a way that would say 'I'd love to talk, but sorry I can't!'\n\n'And how are you today, Victoria?' the man at her door asked. 'Good, I hope! If not, I bring you an eternity of warmth and best wishes from the wonderful director of my company.'\n\nVictoria's smile disappeared. How did he know her name? \n\n'You know how I can be so sure?' he asked. 'I am the wonderful director of my company!'\n\n'I'm sorry,' said Victoria. 'I really have to go. I'm late for work.' \n\n'Time!' He sounded sad. 'That's what they all want. Time or happiness, which one would you like more of?'\n\n'Listen, really,' said Victoria, 'I'm not interested, sorry.' \n\n'We've got a special offer on,' he replied. 'Twenty-five years of extra life in exchange for eternity. Or,' he smiled, 'double your happiness for the same price.'\n\n'Price?' she repeated, confused.\n\n'There are no hidden charges. We take everything you have – forever.'\n\nVictoria thought it was strange that he was wasting time on such a stupid joke. 'Then I want fifty extra years or four times more happiness,' she joked back.\n\n'Oh, you could,' he said. 'But I have to tell you, the quality of the years goes down after twenty-five. I recommend choosing happiness.'\n\nHe pushed the lift button for her. Of course, it was obvious that she was going down because it was morning and she was dressed for work. OK, so her smart bag only had sandwiches in, not important papers, and her suit was second-hand. One day, she'd think of a job she was good at and that paid well. \n\nSometimes Victoria felt as if her sister was the only lucky one in the family. Charlotte had her own prize-winning company and she was married to the handsome and funny Peter. The only thing wrong with Peter was that he didn't have a twin for Victoria to marry! Even the way Charlotte met Peter sounded like a film. After a lot of bad luck, Charlotte was in a car accident. At first, the doctors said she would never walk again but then, a new doctor, Peter, started work at the hospital. With Peter's help, Charlotte was walking again in just a few weeks. Even he joked that no one had known he was such a good doctor before he met Charlotte. He asked her to marry him two months later. Half a year after the accident, Charlotte started her company and now they lived in the most expensive part of London. Victoria was happy for her sister, of course, and she loved visiting their house and seeing their beautiful children, Gabriella and Angela. But sometimes it made her feel bad that she didn't have any good luck for herself.\n\nRemembering Charlotte's accident made her think. It was impossible to know what might happen in the future. 'But what if I get killed by a bus tomorrow?'\n\n'Then your perfect life will only last one day. Time or happiness, I can only offer one. I can't do miracles. Another company does those.' \n\n'Well, maybe you should change jobs,' she said and pressed the lift button herself.  \n\n'No,' he said. 'I've tried working for them. Their sales team makes a very different offer: Have a hard life now, then be happy for eternity. Some customers like the idea but, honestly, it's much harder to sell it.'\n\nThe lift wasn't even moving so she turned towards the stairs. She was going to be so, so late to work. But, as she started down the stairs, she suddenly remembered something.\n\n'Oh no!' she said. 'Gabriella and Angela!' Her little nieces' birthday presents were still sitting on the kitchen table. There wasn't time to go back and get them now. \n\n'It's time you want, isn't it, Victoria? I always know,' he called after her.\n\n'I don't believe these stupid things you're saying and I don't have time to talk to you!'\n\nShe stopped talking because she realised she was admitting that she needed more time. Then she screamed as he slid down the banister and suddenly appeared in front of her, floating in the air with his arms and legs crossed.\n\n'Aha!' he said. 'You want happiness instead!' \n\nVictoria moved backwards and put her hand against the wall so she wouldn't fall. Now she knew who the strange man was.\n\n'I'm happy enough, thanks,' she said, starting to run down the stairs. \n\n'Are you happy, Victoria?' he asked as he continued to slide down the banister with her. 'Of course, your job is not bad. You don't mind that the pay is low and your boss hates you because you're always late. I'm sure you'll find the money to pay your rent, just like you usually do.'\n\n'You can't know that!' she shouted. 'Anyway, money doesn't buy happiness!'\n\n'True, Victoria, true. It's love that makes the world go round.'\n\n'Exactly!' she said. Five more floors to go. \n\n'I'm sure one day you'll meet someone ...' he said.\n\n'I don't need a man to be happy, so if that's all you're offering ...'\n\n'You're so clever, Victoria,' he continued. 'So few people understand that happiness comes from inside us, not from things we can buy or from other people. I see that you're cleverer than many of our customers. Twenty-five years extra then. I can see it in you, Victoria. You won't waste them.'\n\n'But twenty-five more than what?'\n\n'No, no, no.' He turned the last corner with her. 'I won't tell you how long your life is. We've tried it with customers and it doesn't work. When people know how long they are going to live, they don't enjoy their lives.'\n\n'I don't believe in any of this. Or in you!'\n\nHe jumped off the banister and held up something small and white.\n\n'Your sister didn't believe it either,' he said. 'Not until she had her accident. Here's my card if you change your mind.'\n\nAnd he disappeared. Victoria was alone on the stairs, her mouth open in shock.",
    "shortDescription": "A strange salesman knocks on Victoria's door and offers the end to all her problems. Will she say yes or is the price too high?",
    "level" : "advanced",
    "language" : "english"
  },
  {
    "title": "The green wars",
    "source": "Andrew Leon Hudson",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/RS8416_GettyImages-687939992-hig_1.jpg",
    "createdDate": null,
    "content": "Plan 1: Guerrilla gardening\nThe time is what the army call 'oh-three-hundred-hours' – three o'clock in the morning. We're in the car park of the sports centre. It's empty except for me and my best friend, Janey and an old truck. It belongs to the company that put grass on the town football pitch last week.\n\n'What are we doing here?' I ask.\n\n'Here's the plan,' says Janey. 'First, we take that truck ...'\n\n'I'm going home,' I say. 'Good night.'\n\n'Then, we drive to the Town Hall. And then we use the grass in the truck to cover the high street from top to bottom. Like one great big garden. Are you ready?'\n\nI think about it for a moment. Then I smile.\n\n'OK,' I say. 'Let's go.'\n\n...\n\nOur new green high street is beautiful. But we don't have time to enjoy it. The judge says we committed a crime. She gives me 150 hours of community service. Janey gets 300 hours because it was her idea.\n\nI do my hours and return to my studies. Janey spends her time planning how we're going to do our guerrilla gardening better in future. We want to make the whole town green. Janey's ideas will probably put us both in prison. But someone has to help the planet.\n\nPlan 2: The bamboo forest\nEvery September, our town has a festival. Crowds of happy people eat hotdogs and wave little flags. Then everyone goes to the park on the edge of town. The mayor gives a speech, and everyone has fun. \n\nI should be at home packing my bags to go and study engineering at university. But, as soon as everyone has gone to the park, Janey picks me up in another 'borrowed' truck. This one is full of soil.\n\n'Get in,' she says. 'There's enough soil to cover the high street from Baker's Street to Humber Road, right past the new shopping centre. I've mixed it with bamboo seeds. It's a kind of seed that grows really, really fast. Before the festival is over, there will be a mini forest in front of the supermarket. No one will be able to get in or out of that street. It really does grow that fast. What do you think?'\n\nWell … why not? I'll be at university next week anyway. 'Let's do it.'\n\n...\n\nJaney was right, bamboo grows fast. It was as high as your knees before anyone discovered what we had done. By the time the council found someone to cut it down, our bamboo forest was taller than the mayor.\n\nIt was great, but they took it away. After what we did last year, they knew it was us. Plus, Janey had bought the bamboo online with her bank card, so it was definitely her. This time, she got six months in prison.\n\nShe didn't tell them I had helped her, so I still went to university. But I changed my degree to Agriculture and Wildlife. I wanted to learn all about plants, gardening and farming. I thought it would help Janey and me succeed as guerrilla gardeners.\n\nPlan 3: The vertical farm\nI'm wearing my new business suit. My presentation is ready, and there's a small plastic model of my idea on the table. On the other side of the table, my three heads of department are waiting to see my final university project – the vertical farm.\n\nWe've seen what happens when we do what Janey says. Now it's my turn.\n\n'Good morning,' I say. 'During my studies I've learned a lot about city farming. After university, I want to do something with what I've learned.'\n\nI show them the model. 'This is the high street of my town. This is our shopping centre, and this is an old, nine-floor car park. No one has used it for the last two years and it's now for sale.'\n\nI start the presentation. They can see my designs on the big screen while I talk.\n\n'I've designed a city farm using the carpark building. There will be eight floors to farm fruit and vegetables. This design will collect rainwater to water the soil. And we will use energy from the sun to power the special growing lights.'\n\nThe presentation changes to show the maths of how the farm will make money.\n\n'I will rent the space to small local farmers. We will sell everything in local shops to be as good for the environment as possible. Also, the ninth floor will be for any local people who want to grow their own food.'\n\nMy audience looks interested, but I haven't finished yet.\n\n'To prove the project can work, I've talked to local people and farmers. I've received letters of support and interest from all sides. I also gave this presentation to my bank manager. The bank will give me money, - if I can convince the town council to sell me the site.'\n\nI turn off the presentation. 'Are there any questions?'\n\n...\n\nMy project gets the highest marks in my class. But in the real world that doesn't matter. \n\nThe town council didn't accept my plan. Instead, they decided to sell the site to a company who will destroy the car park and build a block of luxury apartments. The mayor says they will bring new energy to the town. So that's the end of the vertical farm.\n\nJaney kept getting in trouble while I was away. But she was out of prison when I came back, so I met her for a drink. \n\n'You should never have changed from my way of doing things,' she tells me. 'Nothing sends our message better than covering streets with grass, trees and plants.' \n\nHer latest trip to prison was for doing exactly that, again. But I have just finished university and my future looks good. \n\nDo you think I was clever enough not to listen to her?\n\nPlan 4: Guerrilla gardening 2.0\nThis time, I agreed to do part of what Janey wanted. \n\nWe drive around town to search for the perfect location. Not in front of the Town Hall or the shopping centre. They are the kinds of places Janey thinks will send the biggest message. But I don't think these are the best places to choose.\n\nI'm looking for something different. Somewhere that's not in the town centre. Not the best neighbourhood, but a poor one. One that never gets any public money. One where the road is full of holes and the pavement is all broken. I'm looking for somewhere where people don't have cars outside their houses.\n\nWe find the perfect place.\n\nOne night, we arrive in another 'borrowed' truck. We carefully fill the whole street with soil from one pavement to the other. It's just like Janey's old plans, but this time we plant vegetable gardens in front of every house. We post letters through people's doors with gardening instructions, so the new lucky owners will know what to do. The letters also mention how much money you can save if you grow your own food – you'd be surprised.\n\nIn the same neighbourhood, we put grass over those broken old pavements for the kids to play on. Finally, we put up a sign that says, 'Please Walk on the Grass'.\n\nWhen we've finished, we're both covered in soil and completely exhausted. But Janey puts an arm around my shoulders and smiles. \n\n'Not a bad plan, for you,' she says. 'You're learning!'\n\n...\n\nThe people from the town council are extremely angry, of course. They send workers to the street to take it all away. But the people who live there join their arms together to protect their new gardens. Can you believe it? \n\nJust as I hoped, the people in this neighbourhood like what we've done to their street!\n\nLater that day, the mayor goes to the area to explain that what we did is a crime. He isn't very pleased when a local TV reporter arrives. \n\nThe reporter asks him, 'The town council hasn't spent any money on this street for 20 years! Now someone else has come and improved it! Why don't you want it to be a place for growing food? Why can't it be a place for children to play and learn?'\n\nIt was the main story on the national evening news, and the whole town was delighted. Well, everyone apart from the mayor, of course.\n\nThe night after that, Janey and I do it again, but this time we work fast and hard. We just leave big piles of soil, seeds and instructions on as many streets as we can.\n\nPeople get the idea now, and we can't do all the work ourselves.\n\nWe manage three more nights of that before the police catch us.\n\nPlan 5: The right place to fight\nSo here I am, in prison.\n\nIt could be worse. The plan was mainly my idea, but I don't have to stay here too long. That's because it's my first time in prison. Or it's my first time as an adult, at least. But Janey has been in prison many times now, so she gets longer. When I get out of prison, she will still have two years left. She doesn't mind too much. She's happy that 'Guerrilla Gardening 2.0' was successful.\n\nWe're in separate buildings in prison, but we both work on the prison farm. I start teaching Janey some of what I learned at university. Soon she has learned everything I can teach her. \n\nWhen it's time for me to get out of prison, we say goodbye.\n\nJaney says, 'Don't worry. I'll look after the farm. When you get sent back here for your next green crime, it'll be waiting for you!'\n\nBut my next plan does not include returning to prison.\n\n...\n\nDo you remember those piles of soil we left in streets all over town? Half of them are vegetable gardens now. The council doesn't like it, but we chose our locations well. The people that live there are really happy. And politicians don't want to take away gardens from happy people. If they do that, people will remember at election time. \n\nOne thing I've learned is this: \n\nIf you want to win the battle, choose the right place to fight.\n\nThe old mayor is retiring this year, you see. So the next time I try to re-green my town, I'll enter the election for the job of town mayor.\n\nLast year I was a guerrilla gardener. \n\nNext year I'll be the mayor. And our town will be the greenest place in the country.",
    "shortDescription": "Two friends take action to create a beautiful green town. But what's the best way to help the environment, and is it worth going to prison for?",
    "level" : "advanced",
    "language" : "english"
  },
  {
    "title": "The hole in the wall",
    "source": "Andrew Leon Hudson",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/RS8534_GettyImages-1096700132-hig.jpg",
    "createdDate": null,
    "content": "Joanna Paresi was the last one left – the last living person in a family who had been market traders for hundreds of years. She was born in a village at the bottom of high mountains, and she had lived there all her life. At the top of the mountains, the stone fruit grew. In autumn, the fruit fell down the mountains. Most of the stone fruit got lost and no one could find them again. But some fruit fell into a small valley. Joanna's family were the only people who knew about the valley.\n\nWhen the stone fruit fell from the trees, they were black and hard. It took four long months for them to become ripe. They turned from black to grey and, finally, to silver. Then people could enjoy the sweet, sun-coloured fruit inside. \n\nWhen it was ripe, the stone fruit was delicious. It was the most popular food in the region. On market day, people got up early and queued for hours to buy it. Joanna's family always had more fruit to sell than anyone else. Her family had made a lot of money by selling the fruit over the years. But they were not as rich as the market sellers who sold their products far away in the capital city. \n\nWhen Joanna was a child, she asked her mother, 'Why don't we go to the capital city to sell the fruit? That's where the most important market in the country is.' Her mother told her that someone had tried once, and they had failed. But she didn't say any more. \n\nAs the years passed, Joanna dreamed of selling stone fruit at the market in the capital. The spring after her mother died, she decided to go. It would take four long months to walk to the capital city. It was exactly how long it took the fruit to become ripe. It would be difficult … but it was possible.\n\nWhen the people in the city tried stone fruit for the first time, they would love it. And, best of all, they would pay a lot. She would earn more money than ever before. \n\n*****\n\nJoanna walked all the way to the capital city. She pushed a wooden cart full of stone fruit. She carried with her a beautiful wooden market stall. The stall had belonged to her mother, and before that to Joanna's grandmother. On this stall, she would sell her fruit. When she finally arrived at the city, she was very tired after months on the road. But the stone fruit were almost ripe. So far, her plan was working.\n\nOf course, there was a tax to enter the city gates. And there were market fees to pay. Plus, it wasn't easy to sell strange, new foods like hers at the market. The fruit had to be tested to prove it was safe to eat. The tests were not cheap and they took days to do.\n\nJoanna spent all her money on the tests. And she also needed a place to sleep while she waited. She really needed money, so she sold her beautiful family stall. She didn't want to do it, but she had no choice. After she sold the fruit, she could buy the stall back.\n\nFinally, the tests were finished and she was allowed to sell her fruit. She used the last of her money to rent a cheap, ordinary stall. But by now the perfect, silver stone fruit had turned white and lost their sweet flavour. \n\nNo customers wanted to buy her overripe fruits from her boring stall. They were starting to look and smell bad. In the end, she sold all the stone fruit to a farmer to feed his pigs. He bought her cart too, and paid her much less than its value.\n\nShe had lost everything.\n\nJoanna left the market in defeat. She walked through the city streets. There were shops of every kind. In one she saw the beautiful stall that her mother had given her. But she had no money to buy it back.\n\nTears ran down her face, and she walked until she was lost in the city streets. At last, she lay down in a corner and fell asleep.\n\n*****\n\nWhen Joanna woke again, it was dark. But there was something even darker on the wall opposite her. It was a hole in the wall.\n\nIt wasn't a door, because it didn't reach the ground. It wasn't a window either. This was just a hole in the wall. It had … nothing. Just like her.\n\nJoanna felt so angry – with the market and with herself. She pulled off one of her boots. It was full of holes from her long journey. She threw it across the street at the hole.\n\nIt disappeared into the hole, but there was no sound as it landed. The boot was gone. It was just one more thing that she had lost by being stupid. Tired and sad, she closed her eyes on the world. But then she heard a sound.\n\nShe opened her eyes again.\n\nThere was something shiny on the ground. It was a coin – a single penny. It was enough to buy a meal. It was definitely worth more than her old boot.\n\nIt must be a joke, she thought. She waited for someone to come out and start laughing at her. But nothing happened. She pulled off her other boot and threw it after the first. She saw it fly through the hole into nothing. But this time she saw another coin fly back out, then a second and a third.\n\nJoanna picked up the nearest coin. She held it close to her face … It was real!\n\nShe picked up the other coins: three pennies. She could buy new boots now. \n\nShe took off her belt and threw it at the hole. In it went – and more coins flew back out. She picked those up too and counted them: ten pennies. Enough for new boots and a simple belt!\n\nExcited, she quickly took off her travelling coat, her jacket and both socks. She threw each one into the hole. \n\nWhen the sound of metal falling on the ground ended, she had a small pile of coins. She counted them, over and over, through the rest of the night.\n\nWhen morning came, the hole in the wall had disappeared. Perhaps she had lost her mind as well as her fruit, her cart and her mother's stall. \n\nFine. She didn't care. She had thirty-eight pennies.\n\nAnd if you're a good trader, all you need is somewhere to start.\n\n*****\n\nJoanna was now a very unusual trader. She had no shoes, socks or coat. She went from shop to shop. With her pile of pennies, she bought:\n\na large bag;\n\na long shirt;\n\na pair of broken wooden shoes;\n\nall the old, broken or useless things the other traders would sell her. \n\nWhen she had spent all her money, Joanna returned to the street where she had spent the night. All day she sat there, looking at the empty wall opposite. People walked past her. Some felt sorry for her. Others wondered what she was doing. But most people didn't pay her any attention. \n\n*****\n\nIn the middle of the night, the hole in the wall appeared again. Joanna was happy that she hadn't imagined it.\n\nShe opened the empty bag in front of the hole. Then, one by one, she threw things into the hole. Even the wooden shoes went in. The only thing she didn't throw in was the bag. When the sun rose in the morning, the bag was full and heavy with coins.\n\n*****\n\nJoanna bought new clothes with the money: a good hat, shirt and trousers, boots to take her home, a thick coat for winter in the mountains, and a new, bigger bag. She had enough money left to do some shopping at the market too. She bought silk carpets, fine wool, bags of spices and more. \n\nAfter a busy day, she returned to one, special shop. There she bought back her mother's stall. And then she went back to her lucky street with all the beautiful things she had bought at the market. \n\nShe sat down for one last night, waiting for the hole.\n\nWhen the hole appeared again, she started throwing the spices into it. Then she threw the wool and silk and the other things. Silver and gold coins flew out of the hole into the bag. Soon her bag was filled with more money than she had ever known. For a moment, she thought about throwing her family stall into the hole as well. But then she had a better idea. \n\nThe hole had always given her more than the value of the things she threw into it. So what about the gold and silver coins? What would the hole give her if she threw all the money in? \n\nWhat could be worth more than all the money she had?\n\nMaybe she would never have to sell stone fruit again! Joanna lifted the heavy bag of coins. She began to move the bag backwards and forwards, faster and faster … and then she threw it.\n\nFive coins came out of the bag and fell by Joanna's feet. The others flew into the hole.\n\nJoanna waited and watched the hole. But this time, nothing came back.\n\n*****\n\nThere was a tax to leave the city. Joanna's last five coins were just enough to pay it.\n\nShe walked out in her good boots and new clothes. On her back, she carried her mother's stall. She walked all day and she slept well at night. She was happy to be going home. As she got further and further away from the capital, she could see the mountains of home. They looked more beautiful than ever.\n\nHer pockets were empty, but her heart was full.\n\nSometimes she met other travellers on the road. When she saw them coming, she put up her beautiful, family stall. The only thing she had to sell was her story. She only asked people to pay a penny or two to hear her story. If they didn't have any money, she asked for some food or drink. No one believed her story was true, but they believed the lessons her story contained. Everyone who heard the story learned a different lesson. For some people, the lesson was 'be happy with what you have' or 'if you want more than you need, you will lose everything.' For others, it was 'wisdom has a high price.'\n\nFor Joanna, the last trader in her family, the lesson was different. It was the answer to her question: What could be worth more than all the money she had? Now she knew the answer was wisdom. ",
    "shortDescription": "Joanna is the last fruit seller in her family. When she goes to the capital city to sell her fruits, she discovers something worth more than money.",
    "level" : "advanced",
    "language" : "english"
  },
  {
    "title": "The time travel plumber",
    "source": "Nicola Prentis",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/RS8415_GettyImages-585284059-hig (2).jpg",
    "createdDate": null,
    "content": "September 17\nPriya and the plumber from TimeTech Insurance company looked around at her flooded kitchen. She hadn't been to the house for weeks. A few months ago, she had moved back to live with her parents to save money because Charlie's hospital bills were so high. She had hoped to sell the house before this but, so far, no one had been interested. Someone was coming to see it tomorrow, the first person in four months. She really needed them to buy it, but no one would want it now. She guessed the water had been in the kitchen for ages because it smelled like old fish. \n\n'Eww!' said Charlie at the horrible smell. He held his nose and made a silly face, the way five-year-olds do. And then he started to cough. But his thin body was too weak for the effort and he stopped. Priya felt even worse about the situation. \n\nShe had called the plumber as soon as she saw the condition of the house. And right after that, she called her boss at the jewellery shop to say she couldn't work today. She was really good at her job and she sold lots of jewellery, but he would probably take money from her pay. Just one of those expensive necklaces would pay for Charlie's operation. It was so unfair! \n\n'Do you mind if I look?' asked the plumber. \n\n'Of course! Please, go in,' she replied. Luckily, the plumber was wearing boots that were about five centimetres higher than the water. He walked slowly towards the sink and opened the cupboard under it to look at the pipes. Then, he took a few photos of the flooded kitchen, one of them with her, Charlie and the dog in. Charlie made another silly face for the photo, which made him look even more pale and ill.\n\n'Can you fix it?' she asked. She didn't have the money to pay someone to repair the kitchen, so she hoped the insurance company would do it. But TimeTech's slogan promised: Say goodbye to every* problem you ever had! Well, Priya definitely wanted to say goodbye to this problem.\n\n'It's your lucky day,' he said, 'as long as the flood happened within the right time period. Now, to be sure, I need to go back two months. The pipe looks as if it's been like this for a while. But I think the flooding actually happened six weeks ago because of the way the water looks.'\n\nPriya shook her head in surprise. It was so hard to believe that this time travel stuff was real.\n\n'Now, I just need to ask a few questions,' he said. He had a pen and paper to make notes, not some complicated machine like you might expect a time traveller to have. 'When did you sign up with TimeTech?'\n\n'August 15,' she said. Her heart sank the moment the words were out of her mouth.\n\n'Oh,' he said. 'That's only a month ago.'\n\n'Oh no! Please don't say you can't fix it! I need to sell the house or I can't pay for Charlie's doctor and—' She began to cry, she couldn't stop herself. 'I had to take the morning off work to come here today and my boss isn't happy. Now he won't pay me for today, which is all I need.'\n\n'We really can't go back to a time before the customer signed up with TimeTech,' he said, 'because it's really hard to make them believe that in the future they're going to be a customer. We tried it a few times but it always went badly.'\n\n'Oh, I'm sure I'll believe you! I was thinking about signing up for a long time before I finally did it,' she said. 'Say goodbye to every problem you ever had, right? I certainly have a lot of problems!' She tried to laugh but, instead, she was almost crying again. \n\nCharlie hugged her legs. Maybe the plumber felt sorry for her or maybe he was just embarrassed but he said, 'You seem as if you're having a hard time so, OK, I'll do this for you.'\n\nHe wrote down some more information, shaking his head. She knew that he was doing her a big favour. 'I'll be back in about half an hour to make sure you're happy with the work, OK?'\n\nThe plumber walked back to the road and disappeared into his van. It was a very ordinary van and it didn't look like a time machine at all. The slogan Say goodbye to every* problem you ever had! was painted on the side of the van. It had a * next to some smaller writing underneath, but she couldn't read it from where she was. \n\nObviously they couldn't wait in the disgusting, flooded kitchen so they sat outside. Charlie was too tired to run around the garden. Instead, he watched the dog trying to dig a hole next to the 'For Sale' sign. \n\nShe went closer to the van and read the small writing under the slogan. \n\n*TimeTech only solves problems involving objects. We CANNOT change situations that happen because of people and their actions.\n\nAaah, now she remembered! TimeTech had been in the news after twelve of their customers went to prison. TimeTech had now added * next to the word 'every' in their slogan. \n\nJust as she was looking at it, the van door opened. 'All fixed!' the plumber said, smiling. \n\n'Was I surprised to see you?' Priya asked. \n\n'Yes! At first, but that's why the photos are so useful. People always believe me when they see themselves in the pictures. You said you couldn't believe you were using TimeTech so soon after signing up.'\n\n'Let's see! Let's see!' Charlie jumped up and down with a new energy. \n\nPriya opened the house door and, just like TimeTech promised, her problem was solved. The kitchen was dry, tidy and smelled normal. \n\n'Wow!' said Charlie.\n\nPriya agreed. 'It's as though the flood never happened!' she said to the plumber.\n\nHe laughed. 'It didn't happen!' he said. 'I put your new pipe in on 17 July and that solved the problem before it could happen. It would be more accurate to say the flood unhappened! But don't think about it too much. Time travel is confusing!'\n\nPriya shook her head. She couldn't believe what had just happened – or unhappened. \n\nJuly 17\nTwo months earlier, Priya was also shaking her head and she also couldn't believe what had just happened. In one way, of course, nothing extraordinary had happened. \n\nA plumber had fixed a pipe in a few minutes. \n\nExcept the pipe wasn't broken – yet – and the plumber had come from the future. \n\nWell, she was glad that future Priya was going to sign up with TimeTech. She had heard a bit about them, but now she really understood what the company did. Say goodbye to every* problem you ever had! the slogan on the van outside her house had said. There was some smaller writing underneath, but she hadn't been close enough to read it. It was amazing – solve all your problems with time travel. She hadn't believed the plumber was telling the truth at first. But when he showed her the photo from the future she knew it was true. The photo showed Charlie looking so pale and thin. It broke her heart to see how much worse her little boy would get in the next two months.\n\n'I've certainly got a lot of problems,' she thought. The biggest was money, of course. Since Charlie had got ill, she had spent all her money on doctors and medicine. But he still needed an operation and if he didn't get it … She didn't want to think about it. She had very little time and she needed money, a lot of it. Until today, she thought selling the house and moving in with her parents was the only way to get enough money to make Charlie better. But now, thanks to TimeTech, she had a better idea. She knew stealing was wrong, time travel didn't change that. 'But my boss is horrible to me,' she thought. 'And anyway, he's so rich he won't notice if a couple of hundred-thousand-pound necklaces disappear. And if I do get caught, well, TimeTech will make it \"unhappen\" and get me out of prison.' Maybe they would help her put the jewellery back or go back in time and show her a photo of herself in prison, or whatever it was they could do. She'd seen her kitchen with her own eyes! TimeTech's insurance was the best insurance you could ever have.\n\nSeptember 17\nAs they waved the plumber goodbye, Charlie ran back into the garden. He played with the dog, who had found a ball in the kitchen. 'Where's the \"For Sale\" sign gone, Mum?' he asked. 'Did the plumber take it away?'\n\n'Something like that,' said Priya. She smiled as she watched him running around. His legs were strong and his little fat face was pink. \n\n'The operation was a success,' she thought. Her old worries were gone. But now that she had read the small writing on the TimeTech van, she had a new fear – that any moment the police would come and she would be the thirteenth person in prison. TimeTech couldn't solve every problem. She had been crazy to imagine they could. So far, it seemed as if her boss hadn't noticed the missing necklaces. She hoped her luck would last.",
    "shortDescription": "Priya's son is ill, she has no money and now her kitchen is flooded. Can time travel make everything better?",
    "level" : "advanced",
    "language" : "english"
  },
  {
    "title": "True Beauty",
    "source": "Nicola Prentis",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/RS8839_GettyImages-639028656-hig.jpg",
    "createdDate": null,
    "content": "Steph was looking at Instagram. There were #blessed yoga photos and #SundayBreakfast pictures. She saw photos of fresh bread and coffee with hearts in the milk. \n\n*****\n\nOn the other side of the city, Matt was doing the same thing. His Instagram was full of #FitBody gym selfies and #beachlife holiday photos. \n\n*****\n\nSteph put some flowers next to her breakfast and took a photo of it. Her eggs and coffee were cold now, but the plate looked good. The plate was from an expensive art market. She had 'borrowed' the flowers from her neighbour's garden. Probably only ten people a day walked past old Mrs Robinson's garden. Flowers are for everyone to enjoy, aren't they? she thought. If she put the picture on Instagram, more people would see the flowers.\n\nSteph changed the colours on her picture to make the orange juice more orange and the pink roses brighter. She was choosing an Instagram filter when she noticed TrueBeauty. She had downloaded it the day before and then forgotten about it. Her picture looked perfect with that filter. She posted the photo for her 15k followers. She hoped some of them would feel jealous of her life. Then she threw the food on her plate into the bin. She didn't want to eat it now that it was cold. \n\n*****\n\nMatt was ready to give up. He had worked out for an hour and he had put cooking oil on his skin so that it would look shiny. But the photos still didn't look good. He only wanted to be fit so that he could put photos on social media. He looked at his Instagram again. He hoped to see some ideas he could copy. Then he noticed an ad for TrueBeauty. \n\nPictures as beautiful as you are. See the real you with TrueBeauty. Available in your app store for £0. Because True Beauty is free.\n\nThat's what he needed. He downloaded the app. In minutes, he had the perfect selfie. In the photos, his body looked amazing. He posted the photo for his 27k followers. Then he got in the shower to wash off all the cooking oil. He remembered reading about all the fat under the city, in the sewers. Millions of people lived in his city. Most of them washed their cooking oil down the sink. The oil went to the sewers. It made a disgusting mess and some poor worker had to clean it. Or did the oil go into the ocean and kill dolphins? He couldn't remember. But it wasn't his problem, was it? It was someone else's problem. \n\n*****\n\nBoth Steph and Matt were surprised to get so few likes. And they weren't prepared for the negative comments they received. \n\nsusieQ Remind me never to get breakfast at your place!\n\ngymguy21 Ewww, disgusting!\n\nThe rest of the comments were even worse.\n\nBoth social media influencers looked again at the pictures they had posted. \n\nSteph's picture showed horrible, green eggs with flies all over them. The flowers were dead, and the coffee looked disgusting and grey. In Matt's picture, his body was covered in something that looked like dirty butter. It was in his hair and in his nose. And, worst of all, his hands were really dirty. It looked as if he had been digging in the garden – or worse. \n\nThey both tried to delete the photos, but they couldn't. The negative comments kept coming. In a way, it was Steph's most popular post. And 50 people had shared Matt's post already. \n\nJust then, everyone who had installed the TrueBeauty filter received a message from the person who had created it. Steph and Matt read:  \n\nDear User,\n\nThank you for making TrueBeauty such an amazing success! Fifty million downloads in the first 24 hours! Wow, it's more than I ever hoped for. Honestly, guys, I am so #blessed.\n\nI know that each of you really, truly cares about showing yourself as you really are. Are you as beautiful on the inside as you are on the outside? If you want your pictures to show the real you, it's time to be as beautiful in real life as you are on your social media. \n\nHave a truly beautiful day, beautiful people!\n\nLove,\n\nTrueBeauty\n\nPS. You can't remove the filter or delete the pictures you posted using it. #SorryNotSorry \n\nPPS. By the way, after the first time you use TrueBeauty, it will change all your photos from that moment on! \n\n*****\n\nFor the next 24 hours, not many people posted photos online. There was only one way people could see if the filter was still destroying their photos: they had to post pictures first and then see how they looked.\n\nThe results were not pretty. \n\nA few of the biggest influencers offered a reward. They joined together to offer a million pounds for the first person to remove the filter. But they couldn't post a picture of themselves holding the money because the pictures were so ugly. So they had to stop advertising the reward. It didn't matter anyway. The person who developed TrueBeauty was too clever and no one could remove the filter. \n\n*****\n\nSteph stopped trying to take pictures after five more horrible pictures. She couldn't remove the TrueBeauty filter. The only thing she could do to hide the ugly pictures was to make her account private. Now, no one could see anything she had ever posted in her life. She felt depressed. She didn't want to do anything if she couldn't post photos of it.\n\nShe went downstairs, past Mrs Robinson's garden. The flowers were more beautiful than ever. She noticed the smell for the first time. Lovely! She stopped and smelled a large, purple rose. \n\n'Hello,' said Mrs Robinson. Steph was surprised because she didn't know Mrs Robinson was there. \n\n'Oh, sorry!' said Mrs Robinson. 'I was just putting water on the plants. At this time of year, there's always so much to do.'\n\nSteph looked around. She hadn't realised it was hard work to make a garden look nice. In fact, she had never really spoken to Mrs Robinson. She had a new thought.\n\n'Do you want some help?' Steph asked. After all, she didn't have anything else to do.\n\n'Oh, thank you, dear! That would be lovely!' Mrs Robinson looked delighted. Steph actually felt happy for the first time since the whole TrueBeauty nightmare had started.\n\nA couple of hours later, to be honest, Steph didn't think the garden looked very different. But Mrs Robinson said she had been a great help. Steph had enjoyed herself a lot. Mrs Robinson had been an actor in the past and she had some amazing stories to tell. \n\n'Take a picture of us, dear,' said Mrs Robinson as Steph was leaving. 'One of those selfies everyone loves.' \n\nSteph almost said no. What could she do with photos now? But Mrs Robinson would be happy with an ordinary picture. Steph supposed she could take one. She took a quick picture of the two of them. They were standing together in front of the roses, smiling and looking a little bit shiny and hot. \n\nLater that evening she looked at the picture on her phone. She changed the colours a little bit. But the roses looked beautiful anyway, with or without any changes. And nothing could improve the smiles on her and Mrs Robinson's faces. \n\nThat's a really beautiful picture, she thought. It's a shame TrueBeauty will destroy it if I post it. \n\nBut then she had a thought. She went back and read TrueBeauty's message again.\n\nAnd then she posted her picture. When the picture went online, it looked exactly the same! She made her account public again. Then she added some text to the photo. \n\nMe and my neighbour in her garden #TrueBeauty #BeautyIsOnTheInside \n\n*****\n\nOne of Steph's followers, Matt, saw her photo. At first, he was just pleased to see a nice photo for a change. He hadn't been to the gym for two days. He supposed he was kind of depressed. Maybe he felt bad because he hadn't exercised. Or maybe it was because of all the horrible, ugly photos he'd seen.\n\nThen he had an idea as he read @Steph's post. Maybe it wouldn't work, but it was worth trying. He picked up all the paper, plastic and glass in his house. He put it into three different piles. Then he looked again at @Steph's picture. He went and knocked on his neighbour's door. He asked her if he could take her rubbish to the bins. The young mother who answered the door was surprised at his offer of help, but she said yes.\n\n*****\n\nWhile Matt was at the recycling bins, he took a photo of himself next to the green glass bin. He posted the smiling selfie with the hashtag #TrueBeauty. He saw that #TrueBeauty was the fifth most popular hashtag. His picture, like many of the others, was nothing special. It was just a smiling guy, a guy who was doing something ordinary after helping his neighbour. It was a truly beautiful photo. ",
    "shortDescription": "With a new app, a photo can show your true beauty. Read what happens when people see how beautiful they are on the inside.",
    "level" : "advanced",
    "language" : "english"
  },
  {
    "title": "Androcles & the Lion",
    "source": "storiestogrowby.org",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/AndroclestheLion2.webp",
    "createdDate": null,
    "content": "This story takes place in Rome, where a Greek slave named Androcles escaped from his master and fled into the forest. There he wandered for a long time until he was weary and well nigh spent with hunger and despair. Just then he heard a lion near him moaning and groaning and at times roaring terribly. Tired as he was, Androcles rose up and rushed away, as he thought, from the lion; but as he made his way through the bushes he stumbled over the root of a tree and fell down lamed. When he tried to get up, there he saw the lion coming towards him, limping on three feet and holding his forepaw in front of him.\nAndrocles was in despair; he had no strength to rise and run away, and there was the lion coming upon him. But when the great beast came up to him instead of attacking him it kept on moaning and looking at him, he saw that the lion was holding out his right paw, it was covered with blood and much swollen.\n\n \n\nAndrocles and the Lion\n \n\nLooking more closely at it, Androcles saw a great big thorn pressed into the paw, which was the cause of all the lion's trouble. Plucking up courage he seized hold of the thorn and drew it out of the lion's paw, who roared with pain when the thorn came out, but soon after found such relief from it that he fawned upon Androcles and showed, in every way that he knew, to whom he owed the relief. Instead of eating him up, he brought him a young deer that he had slain, and Androcles managed to make a meal from it. For some time the lion continued to bring the game he had killed to Androcles, who became quite fond of the huge beast.\nBut one day a number of soldiers came marching through the forest and found Androcles. As he could not explain what he was doing, they took him prisoner and brought him back to the town from which he had fled. Here his master soon found him and brought him before the authorities. Soon Androcles was condemned to death for fleeing from his master. Now it used to be the custom to throw murderers and other criminals to the lions in a huge circus, so that while the criminals were punished the public could enjoy the spectacle of a combat between them and the wild beasts.\n\nSo Androcles was condemned to be thrown to the lions, and on the appointed day he was led forth into the Arena and left there alone with only a spear to protect him from the lion. The Emperor was in the royal box that day and gave the signal for the lion to come out and attack Androcles. But when it came out of its cage and got near Androcles, what do you think it did? Instead of jumping upon him, it fawned upon him and stroked him with its paw and made no attempt to do him any harm.\n\n \n\nAndrocles and the Lion\n \n\nIt was of course the lion which Androcles had met in the forest. The Emperor, surprised at seeing such a strange behavior in so cruel a beast, summoned Androcles to him and asked him how it happened that this particular lion had lost all its cruelty of disposition. So Androcles told the Emperor all that had happened to him and how the lion was showing its gratitude for his having relieved it of the thorn. Thereupon the Emperor pardoned Androcles and ordered his master to set him free, while the lion was taken back into the forest and let loose to enjoy liberty once more.",
    "shortDescription": "THIS STORY takes place in Rome, where a Greek slave named Androcles escaped from his master and fled into the forest.",
    "level" : "elementary",
    "language" : "english"
  },
  {
    "title": "Beauty and the Beast",
    "source": "storiestogrowby.org",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/cover-11.webp",
    "createdDate": null,
    "content": "THERE WAS ONCE a very rich merchant who had three daughters; being a man of sense, he spared no cost for their education. His daughters grew to be very beautiful, especially the youngest, who was called Beauty, a special name that made her sisters very jealous of her.\nThe two eldest had a great deal of pride because they were rich. They gave themselves ridiculous airs, and would not visit other merchants' daughters, nor keep company with any but persons of quality. They went out every day to parties, balls, plays, concerts, and so forth, and they laughed at their youngest sister, because she spent the greatest part of her time in reading good books.\n\n \n\nBeauty and the Beast\n \n\nSuddenly, all at once the merchant lost his whole fortune, accepting a small country house at a great distance from town, and told his children with tears in his eyes that they must go there and work for their living. The two eldest answered that they would never have to leave the town, for they had several prominent merchants who they were sure would be glad to have them, though they had no fortune. But the good ladies were mistaken, for their lovers slighted and forsook them in their poverty. As they were not liked on account of their pride, everybody said; they do not deserve to be pitied, we are very glad to see their pride humbled, let them go and give themselves quality airs in milking the cows and minding their dairy. But, added they, we are extremely concerned for Beauty, she is such a charming, sweet-tempered creature who speaks so kindly to poor people and has such a friendly, gracious nature.\nWhen they came to their country house, the merchant applied himself to farming and Beauty rose at four in the morning. Before the others stirred, she made haste to clean the house and prepare breakfast for the family. In the beginning she found it very difficult, for she had not been used to work as a servant, but in less than two months she grew stronger and healthier than ever. After she had done her work, she read, played on the harpsichord, or else sung while she spun yarn.\n\nOn the contrary, her two sisters did not know how to spend their time. They got up at ten and did nothing but saunter about the whole day, lamenting the loss of their fine clothes and acquaintance. \"Do but see our youngest sister,\" they snickered, one to the other, \"how well she's suited to a life of menial labor.\"\n\n \n\nBeauty and the Beast\n \n\nThe family had lived about a year in the country house when the merchant received a letter with an account that a ship he thought had been lost at sea, that held on board dozens of bolts of cloth and silks he had purchased, had in fact safely arrived. The family rejoiced in the turn of their fortune. When the two eldest daughters saw their father ready to set out, one begged of him to buy her a new necklace of gems, and the other a thick golden chain, but Beauty asked only for a rose.\nThe good man set off on his journey. But when he came there, oh such problems there were over who properly owned the ship and the merchandise on board, and after a great deal of trouble and pains to no purpose, he came back as poor as before, especially after he bought the fine new necklace and gold chain he promised to his two older daughters. Thinking he might come upon a rosebush to satisfy the wish of his youngest daughter, he led his horse deep into the woods. As the sun set and the wind began to howl, the poor man realized he was hopelessly lost. What's more, with the rain and the snow he knew he might well starve to death with cold or hunger, or be devoured by the wolves, whom he heard howling all round him. Then in an instant, looking through a long walk of trees, he saw a light at some distance. Going on a little farther, he noticed it came from a place lit with candles from top to bottom.\n\n \n\nBeauty and the Beast\n \n\nThe merchant hastened to the place, but was greatly surprised at not meeting anyone in the outer courts. His horse followed him, and seeing a large stable open, went in, and finding both hay and oats, the poor beast, who was almost famished, fell to eating very heartily. The merchant tied him up to the manger and walked towards the house, where he saw no one. Entering into a large hall, he found a good fire and a table plentifully set out. As he was wet quite through with the rain and snow, he drew near the fire to dry himself. \"I hope,\" said he, \"the master of the house, or his servants will excuse the liberty I take; I suppose it will not be long before some of them appear.\"\n\n \n\nHe waited a considerable time, until it struck eleven, and still nobody came.\n\n \n\nAt last he was so hungry that he could stand it no longer, but took a leg of chicken and ate it in two mouthfuls, trembling all the while. After this he drank a few glasses of wine. Growing more courageous, he went out of the hall and crossed through several grand apartments with magnificent furniture, until he came into a chamber. In the chamber was an exceedingly good bed, and as he was very tired and it was past midnight, he concluded it was best to shut the door and go to sleep.\n\nIt was ten the next morning before the merchant waked. As he was going to rise he was astonished to see a good suit of clothes laid out on the bed that would fit him perfectly. Certainly, said he, this palace belongs to some kind fairy, who has seen and pitied my distress. He then returned to the great hall where he had supped the night before, and found some chocolate ready made on a little table. \"Thank you, good Madam Fairy,\" said he aloud, \"for being so careful as to provide me a breakfast. I am extremely obliged to you for all your favors.\"\nThe good man drank his chocolate and then went to look for his horse, but passing through an arbor of roses he remembered Beauty's request to him, and gathered a branch on which were several. Immediately he heard a great crash like thunder, and looking around he saw a huge monster - two tusks in his mouth and fiery red eyes surrounded by bristles and horns coming out of its head and spreading over its back.\n\n \n\n\"Mortal,\" roared the beast, \"who told you you might pluck my rose?\"\n\n \n\n\"Please, sir,\" said the merchant in fear and terror for his life, \"I promised my daughter to bring her home a rose and forgot about it till the last moment, and then I saw your beautiful garden and thought you would not miss a single rose, or else I would have asked your permission.\"\n\"Thieving is thieving,\" said the beast, \"whether it be a rose or a diamond; your life is forfeit.\"\nThe merchant fell on his knees and begged for his life for the sake of his three daughters who had none but him to support them. \"My lord,\" said he, \"I beseech you to forgive me, indeed I had no intention to offend in gathering a rose for one of my daughters, who desired me to bring her one.\"\n\n \n\nBeauty and the Beast\n \n\n\"You say you have daughters,\" replied the monster. \"I will forgive you, on one condition - that one of them come willingly and suffer for you. Swear that if any of your daughters refuses to die in your stead, you will return within three months and place yourself at my disposal.\"\n\nSo the merchant swore. Taking his rose, he mounted his horse and rode home.\n\nAs soon as he got into his house, his daughters came rushing round him, clapping their hands and showing their joy in every way. He gave the necklace to his eldest daughter, the gold chain to his second daughter, and then he gave the rose to his youngest, and as he gave it he sighed.\n\n\"Oh, thank you, father,\" they all cried.\n\nBut the youngest said, \"Why did you sigh so deeply when you gave me my rose?\"\n\n\"Later I will tell you,\" said the merchant.\nSo for several days they lived happily together, though the merchant wandered about gloomy and sad, and nothing his daughters could do would cheer him up till at last, pressed by his youngest daughter, he related his fatal adventure.\n\n \n\nImmediately the two eldest set up lamentable outcries, blaming poor Beauty, and said all manner of ill-natured things to her.\n\n \n\nBeauty spoke: \"Since the monster will accept one of his daughter,\" said she, \"I will deliver myself up to all his fury, and I am very happy in thinking that my death will save my father's life, and be a proof of my tender love for him.\"\n\n\"Beauty, I am charmed with your kind and generous offer,\" said the merchant, \"but I cannot let you do it. I am old and have not long to live, so can will lose only a few years, at the most.\"\n\"Indeed father,\" said Beauty, \"you shall not go to the palace without me, you cannot stop me from following you.\" Beauty insisted on setting out for the palace, and made the necessary preparations for herself, and her sisters were secretly delighted at the prospect of getting rid of her once and for all.\n\nSo next day the merchant took Beauty behind him on his horse, as was the custom in those days, and rode off to the dwelling of the beast. When he got there and they alighted from his horse the doors of the house opened, and what do you think they saw there? Nothing.\n\n \n\nSo they went up the steps and went through the hall into the dining room.\n \n\nThere they saw a table spread with all manner of beautiful glasses and plates and dishes and napery, with plenty to eat upon it. So they waited and they waited, thinking that the owner of the house would appear, till at last the merchant said, \"Let's sit down and see what happens then.\" When they sat down, invisible hands passed them things to eat and to drink, and they ate and drank to their heart's content. And when they arose from the table it arose too and disappeared through the door as if it were being carried by invisible servants.\n\nSuddenly the Beast filled the doorway. \"Is this your youngest daughter?\" he boomed.\n\nAnd when he had said that it was, the Beast said, \"Is she willing to stay here with me?\"\n\nThen he looked at Beauty who said, in a trembling voice, \"Yes, sir.\"\n\n \n\nBeauty and the Beast\n \n\n\"Well, no harm shall befall you.\" With that he led the merchant down to his horse and said to him, \"Honest man, go your ways tomorrow morning, but never think of coming here again.\" Then the Beast returned to Beauty and said to her, \"This house with all that is therein is yours; if you desire anything, clap your hands and say the word and it shall be brought to you.\" And with that he made a sort of bow and went away.\n\nSo Beauty lived on in the home of the Beast and was waited on by invisible servants and had whatever she liked to eat and to drink, but she soon got tired of the solitude. Next day, when the Beast came to her, though he looked so frightening, she had been so well treated that she had lost a great deal of her terror of him. So they spoke together about the garden and the house and her father's business and all manner of things, so that Beauty lost altogether her fear of the beast.\n\"Beauty,\" said the Beast, \"if my presence is troublesome, I will end our conversation and leavy you. For tell me, do not you think me very ugly?\"\n\n\"It is true,\" said Beauty, \"for I cannot tell a lie, but I believe you are very good natured.\"\n\n \n\n\"Yes, yes,\" said the Beast, \"my heart is good, but still I am a monster.\"\n\n \n\n\"Among mankind,\" says Beauty, \"there are many that deserve that name more than you, and I prefer you, just as you are, to those, who, under a human form, hide a treacherous, corrupt, and ungrateful heart.\"\nBeauty ate a hearty supper and had almost conquered her dread of the monster, but she nearly fainted away when he said to her, \"Beauty, will you be my wife?\"\n\nIt was some time before she dared answer, for she was afraid of making him angry if she refused. At last, however, she said trembling, \"No, Beast.\" Immediately the poor monster sighed, and then hissed so frightfully that the whole palace echoed. But Beauty soon recovered her fright, for Beast said in a mournful voice, \"then farewell, Beauty,\" and left the room.\n\nBeauty spent the next three months very contentedly in the palace. Seeing the Beast often had so accustomed her to his deformity, that, far from dreading the time of his visit, she would often look on her watch to see when it would be nine, for the Beast never missed coming at that hour. There was only one thing that gave Beauty any concern, which was that every night, before she went to bed, the monster always asked her, if she would be his wife. One day she said to him, \"Beast, you make me very uneasy, I wish I could consent to marry you, but I am too sincere to make you believe that will ever happen; I shall always esteem you as a friend, please try to be satisfied with this.\"\n \n\nBeauty and the Beast\n \n\n\"I suppose I must,\" said the Beast, \"for, alas! I know too well my own misfortune. Though I ought to think myself happy that you will stay here; promise never to leave me.\"\n\nBeauty blushed at these words. \"I could,\" answered she, \"indeed, promise never to leave you, but I have so great a desire to see my father that I'm afraid I shall fret to death if you refuse me that satisfaction.\"\n\"Perhaps this will help,\" said the Beast. He handed her a handled looking-glass and in the round mirror was the image of Beauty's father, pining himself sick for the loss of her.\n\n \n\nBeauty and the Beast\n \n\n\"Oh!\" she cried, and all the color rushed from her face.\n\n\"I would rather die myself,\" said the monster, \"than give you the least uneasiness. I will send you to your father. You may remain with him for one week, but if you do not return before the end of the week, poor Beast will die with grief.\"\n\n\"I give you my promise,\" said Beauty, \"to return in a week.\"\n\n\"You shall be there tomorrow morning,\" said the Beast. \"Take this magic looking-glass with you, and this ring. You need only to lay your ring on the mirror before you go to bed, when you have a mind to come back. Farewell Beauty.\"\nWhen Beauty waked the next morning, she found herself at her father's house. She quickly dressed and came to the kitchen, where her father gave a loud shriek and thought he would die with joy to see his dear daughter again. He held her fast locked in his arms over a quarter of an hour. As soon as the first transports were over, the father shared with Beauty the good news - both her sisters were married.\n\nBeauty sent for her sisters who hastened thither with their husbands.\n\n \n\nThey were both of them very unhappy.\n \n\nThe eldest had married a gentleman, extremely handsome indeed, but so fond of his own person, that he was full of nothing but his own dear self, and neglected his wife. The second had married a man of wit, but he only made use of it to plague and torment everybody, and his wife most of all. Beauty's sisters sickened with envy, when they saw her dressed like a princess, and more beautiful than ever, nor could all her obliging affectionate behavior stifle their jealousy, which was ready to burst when she told them how happy she was. They went down into the garden to vent it in tears; and said one to the other, in what way is this little creature better than us, that she should be so much happier? \"Sister,\" said the oldest, \"a thought strikes my mind. She told us of the promise to stay only for one week. Let us try to keep her beyond the week. Perhaps the monster will be so enraged for breaking her word that he will devour her.\"\n\n\"Right, sister,\" answered the other. They went back to the house and behaved so affectionately to their sister that poor Beauty wept for joy. When the week was expired, they cried and tore their hair, and seemed so sorry to part with her that she promised to stay a week longer.\nIn the meantime, Beauty could not help feeling uneasy that she was likely causing pain for poor Beast, whom she sincerely loved, and really longed to see again. The tenth night she spent at her father's, she dreamed of the Beast in the palace garden, suffering, maybe even dying, for loneliness for her. Beauty was startled from her sleep, sat up straight in bed, and burst into tears. \"Am I not very wicked,\" said she, \"to act so unkindly to Beast, who has tried so hard to please me in everything? Is it his fault if he is so ugly?  He is kind and good, and that is more than enough. Why did I refuse to marry him? I would be happier with the monster than my sisters are with their husbands; it is neither wit, nor a fine face, in a husband, that makes a woman happy, but virtue, sweetness of temper, and thoughtfulness, and Beast has all these valuable qualifications. Having said this, Beauty rose, put her ring on the mirror, and then laid down again; scarce was she in bed before she fell asleep, and when she waked the next morning, she was overjoyed to find herself in the Beast's palace.\n\n \n\nBeauty and the Beast\n \n\nShe put on one of her richest suits, and waited for evening with the utmost impatience, at last the wished-for hour came, the clock struck nine, yet no Beast appeared. Beauty then feared she had been the cause of his death; she ran crying and wringing her hands all about the palace, like one in despair; after having sought for him everywhere, she remembered her dream and flew to the garden, where she had dreamed she saw him. There she found poor Beast stretched out, quite senseless, and, as she imagined, dead. She threw herself upon him and finding his heart beating still, she fetched some water from the canal and poured it on his head. Beast opened his eyes, and said to Beauty, \"You forgot your promise, and I was so afflicted for having lost you that I resolved to starve myself, but since I have the happiness of seeing you once more, I die satisfied.\"\n\n \n\nBeauty and the Beast\n \n\n\"No, dear Beast,\" said Beauty, \"you must not die. Live to be my husband; from this moment I give you my hand, and swear to be none but yours. Alas! I thought I had only a friendship for you, but the grief I now feel convinces me that I cannot live without you.\"\n\nNo sooner had she said this than the hide of the beast split in two and out came a most handsome young prince. The prince told her that he had been enchanted by a magician and could not recover his natural form until a maiden would, of her own free will, declare that she loved him.\nThereupon the prince sent for the merchant and his daughters, and he was married to Beauty, and they all lived happily ever after.",
    "shortDescription": "\n\"Yes, yes,\" said the Beast, \"my heart is good, but still I am a monster.\"",
    "level" : "elementary",
    "language" : "english"
  },
  {
    "title": "The Velveteen Rabbit",
    "source": "storiestogrowby.org",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/Velveteen-Rabbit_3.webp",
    "createdDate": null,
    "content": "A soft and fluffy Velveteen Rabbit lived in a toybox in a Boy's room.  Each day, the Boy opened the toybox and picked up Velveteen Rabbit. And Velveteen Rabbit was happy.\n\n \n\nVelveteen Rabbit\n \n\nThen newer, brighter toys came into the toybox.  They had special tricks.  Some could move when the Boy pushed a button.  Others bounced high. \n\nVelveteen Rabbit had no special tricks or buttons. No wonder the Boy started to choose these other new toys.  \n\nAt night, when the toys were back all in the toy box, the other toys talked with pride about the fine things they could do. Velveteen Rabbit was quiet.  There was not much to say.\n\n \n\nVelveteen Rabbit\n \n\nOnly one other toy in the toy box was like Velveteen Rabbit.  Cowboy Horse was also a soft, fluffy toy.  But he was old.  Most of his hair was worn away.\n\nCowboy Horse said to Velveteen Rabbit, “Soft toys like us are really the lucky ones.  We get loved the most.  And when soft toys get loved and loved, we can become Real.”\n“What is Real?” said Velveteen Rabbit.\n\n“Being Real is the best,\" said Cowboy Horse.  \"You can move when you want to move. When you are Real, if you are loved, you can show your love back.”\n\n \n\n\n \n\nOne day Nana, who took care of the Boy, flew open the lid of the toy box.  She said in a busy tone, “Oh, dear!  That walking doggie is missing. I must find something else for the Boy!”  In a second, Velveteen Rabbit was plopped down onto the bed with the Boy.\n\nThis began another happy time for Velveteen Rabbit.  Each night the Boy would hold Velveteen Rabbit close in his arms.  In the morning, the Boy would show Velveteen Rabbit how to make rabbit holes under the sheets.  If the Boy went outside to a picnic, or to the park, Velveteen Rabbit would come with him, too.  \nAfter awhile, with the hugging and holding, much of Velveteen Rabbit’s fur got matted down.  Its pink nose grew less pink with all the Boy’s kisses.  But Velveteen Rabbit did not care.  It was happy.\n\nOne day the Boy became sick.  His forehead got very hot.  The doctor came and went.  Nana walked back and forth in fear.  Day after day, the Boy stayed in bed.   There was nothing for Velveteen Rabbit to do but to stay in bed, too, day after day.  \n\n \n\nVelveteen Rabbit\n \n\nThen at last, the Boy got better.  Such joy in the house! The doctor said the Boy must go to the shore.  How wonderful! thought Velveteen Rabbit.  Many times the Boy had talked happily about the shore, and told of its white sands and big blue ocean.  \n\n“What about this old bunny?” Nana asked the doctor.\n\n“That old thing?” said the doctor.  “It’s full of scarlet fever germs.  Burn it at once!  Get him a new bunny.”\n\nSo Velveteen Rabbit was thrown into a sack along with the Boy's bed sheets and old clothes and a lot of junk.  The sack was carried to the backyard.  The gardener was told to burn the whole thing.\n\nBut the gardener was too busy with picking the beans and peas before nightfall, so he left the sack behind.  “I will take care of it tomorrow,” he said.  The sack was not tied at the top, and Velveteen Rabbit fell out.  \n\n \n\nVelveteen Rabbit\n \n\nThe next day when the gardener picked up the sack to take it away to be burned, Velveteen Rabbit was not in it.\nThen it started to rain.  Velveteen Rabbit was sad.  So far away from the Boy, never again to be nice and cozy together, and now soaking wet!  A tear fell from Velveteen Rabbit’s eye, over his cheek.  It plopped onto the grass.\n\nAll at once, at the spot where the tear fell, a flower grew up.  Then the bud of the flower opened.  A tiny Fairy!\n\n \n\nVelveteen Rabbit\n \n\n“Little Rabbit,” said the Fairy.  “Do you know who I am?”\n\n“I wish I did,” said Velveteen Rabbit.\n\n“I am the Fairy that takes care of toys that are well loved,” said the Fairy.  \n\nBy then, Velveteen Rabbit was shabby and gray.  The boy had loved off all of its whiskers.  The pink lining in the ears had long turned grey. Its brown spots, once fresh and bright, were now faded and hard to see.\n“It is time now for me to make you Real,” said the Fairy.  \n\n“I think I remember Real,” said Velveteen Rabbit.  Now, what was it Cowboy Horse had said?  Ah yes.  When you are Real, you can move when you want to move.  If you are loved, you can love back.\n\nWith one touch of the Fairy’s wand, Velveteen Rabbit felt different.  Tickly.  All of a sudden, each one of its two legs sewn together tight, could move!  \nA fly landed on Velveteen Rabbit’s head and it was itchy.  As quick as a wink, that foot was up at the Velveteen Rabbit’s head to scratch it off.\n\n \n\n\n \n\n“So this is being Real\"! “I can move when I want to move!”\n\n“I will show you some new friends,” said the Fairy.  And the Fairy took Velveteen Rabbit where several rabbits ran and hopped about.  Soon they were all great friends.\n\nTime went by.  The Boy was back from the shore.  He was all better now. \n\nOne day, the Boy went to the backyard to play.  From the trees nearby, a few rabbits hopped out.  One rabbit was brown all over, and another one was all white.  A third rabbit had brown spots, most of them faded.  That one hopped the closest to the Boy.\n\n \n\nVelveteen Rabbit\n \n\nThe Boy thought, \"Why, this rabbit looks just like my old Bunny that was lost when I was sick.  I loved that Bunny!\"\n\nWhat he didn't know was that it was his very own Bunny, come back to see the boy. For he was the reason the Velveteen Rabbit had become Real.",
    "shortDescription": "A soft and fluffy Velveteen Rabbit lived in a toybox in a Boy's room.  Each day, the Boy opened the toybox and picked up Velveteen Rabbit. And Velveteen Rabbit was happy.",
    "level" : "elementary",
    "language" : "english"
  },
  {
    "title": "Cinderella Fairytale",
    "source": "storiestogrowby.org",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/05.webp",
    "createdDate": null,
    "content": "ONCE UPON A TIME a girl named Cinderella lived with her stepmother and two stepsisters.  Poor Cinderella had to work hard all day long so the others could rest. It was she who had to wake up each morning when it was still dark and cold to start the fire.  It was she who cooked the meals. It was she who kept the fire going. The poor girl could not stay clean, from all the ashes and cinders by the fire.\n\n \n\nCinderella Story\n \n\n“What a mess!” her two stepsisters laughed.  And that is why they called her “Cinderella.”\nOne day, big news came to town.  The King and Queen were going to have a ball!  It was time for the Prince to find a bride. All of the young ladies in the land were invited to come.  They were wild with joy! They would wear their most beautiful gown and fix their hair extra nice. Maybe the prince would like them!\n\nAt Cinderella’s house, she now had extra work to do.  She had to make two brand-new gowns for her step-sisters.  \n\n“Faster!” shouted one step-sister.\n\n“You call that a dress?” screamed the other.  \n\n“Oh, dear!” said Cinderella.  “When can I–“\nThe stepmother marched into the room.  “When can you WHAT?”\n\n \n\nCinderella Story\n \n\n“Well,” said the girl, “when will I have time to make my own dress for the ball?”\n\n“You?” yelled the stepmother.  “Who said YOU were going to the ball?”\n\n“What a laugh!” said one step-sister.\n“Such a mess!” They pointed at Cinderella.  All of them laughed.\n\nCinderella said to herself, “When they look at me, maybe they see a mess.  But I am not that way.  And if I could, I WOULD go to the ball.”\n\nSoon the time came for the stepmother and step-sisters to leave for the big party.\n\n \n\nCinderella Story\n \n\nTheir fine carriage came to the door. The stepmother and step-sisters hopped inside.  And they were off.\n\n“Good-bye!” called Cinderella.  “Have a good time!” But her stepmother and step-sisters did not turn around to see her.\n“Ah, me!” said Cinderella sadly.  The carriage rode down the street.  She said aloud, “I wish I could go to the ball, too!”\n\nThen - Poof!\nAll of a sudden, in front of her was a fairy.\n\n“You called?” said the fairy.\n\n \n\nCinderella Story\n \n\n“Did I?” said Cinderella.  “Who are you?”\n\n“Why, your Fairy Godmother, of course!  I know your wish.  And I have come to grant it.”\n\n“But…” said Cinderella, “my wish is impossible.”\n\n“Excuse me!” said the Fairy Godmother in a huff.  “Did I not just show up out of thin air?”\n\n“Yes, you did,” said Cinderella.\n“Then let me be the one to say what is possible or not!”\n\n“Well, I think you know I want to go to the ball, too.” She looked down at her dirty clothes.\n\n “But look at me.”\n\n“You do look a bit of a mess, child,” said the Fairy Godmother.\n\n“Even if I had something nice to wear,\" said the girl, \"I would have no way to get there.\"\n\n“Dear me, all of that is possible,” said the Fairy. With that, she tapped her wand on Cinderella’s head.\nCinderella Story\n \n\nAt once, Cinderella was all clean.  She was dressed in a beautiful blue gown.  Her hair was set up high on her head inside a golden band.\n\n“This is wonderful!” said Cinderella.\n“Who said I was done?” said the Fairy Godmother.  She tapped her wand again. At once, a beautiful carriage came to be, with a driver and four white horses.\n\n \n\nCinderella Story\n \n\n“Am I dreaming?” said Cinderella, looking around her.\n\n“It is as real, as real can be,” said the Fairy Godmother.  “But there is one thing you must know.”\n\n“What is that?”\n\n“All of this lasts only to midnight.  Tonight, at the stroke of midnight, it will all be over.  Everything will go back to how it was before.”\n“Then I must be sure to leave the ball before midnight!” said Cinderella.\n\n“Good idea,” said the Fairy Godmother.  She stepped back. “My work is done.” And with that, the Fairy Godmother was gone.\nCinderella looked around her.  \"Did that even happen?\"  But there she stood in a fine gown, and with a golden band in her hair.  And there were her driver and four horses before her, waiting.\n\n“Coming?” called the driver.\n\nShe stepped into the carriage.  And they were off.\n\nOver at the ball, the Prince did not know what to think.  “Why do you have that sad look on your face?” the Queen said to her son.  “Look around you! You could not ask for finer maidens than these.”\n\n“I know, Mother,” said the Prince.  Yet he knew something was wrong. He had met many of the young women.  Yet after he said “hello,” one by one, he could find nothing more to say.\n\n\"Look!\"  Someone pointed to the front door.  “Who is that?”\n\nAll heads turned.  Who was that lovely maiden stepping down the stairs?  She held her head tall and looked as if she belonged. But no one knew her.\n\n \n\nCinderella Story\n \n\n“There is something about her,” said the Prince to himself.  “I will ask her to dance.” And he walked over to Cinderella.\n\n“Have we met?” said the Prince.\n\n“I am pleased to meet you now,” said Cinderella with a bow.\n\n“I feel as if I know you,” said the Prince.  “But of course, that is impossible.”\n“Many things are possible,” said Cinderella, “if you wish them to be true.”\n\nThe Prince felt a leap in his heart.  He and Cinderella danced. When the song was over, they danced again.  And then they danced again, and yet again. Soon the other maidens at the ball grew jealous.  “Why is he dancing all the time with her?” they said. “How rude!”\n\n \n\nCinderella Story\n \n\nBut all the Prince could see was Cinderella.  They laughed and talked, and they danced some more.  In fact, they danced for so long that Cinderella did not see the clock.\n\n“Dong!” said the clock.\n\nCinderella looked up.  \n\n“Dong!” went the clock again.  \n\nShe looked up again.  “Oh, my!” she cried out.  “It is almost midnight!”\n\n“Dong!” rung the clock.  \n\n“Why does that matter?” said the Prince.\n“Dong!” called the clock.\n\n“I must go!” said Cinderella.  \n\n“Dong!” went the clock.\n\n“But we just met!” said the Prince.  “Why leave now?”\n\n“Dong!” rung the clock.\n\n“I must GO!” said Cinderella.  She ran to the steps.\n\n“Dong!” said the clock.\n\n“I cannot hear you,” said the Prince.  “The clock is too loud!”\n\n“Dong!” rung the clock.\n\n“Goodbye!” said Cinderella. Up, up the stairs she ran.\n\n“Dong!” went the clock.\n\n“Please, stop for a moment!” said the Prince.\n\n“Oh, dear!” she said as one glass slipper fell off her foot on the stair.  But Cinderella kept running up.\n“Dong!” said the clock.\n\n“Please wait a moment!” said the Prince.  \n\n“Dong!” rung the clock.\n\n“Goodbye!” Cinderella turned one last time.  Then she rushed out the door.\n\n“Dong!”  The clock was quiet. It was midnight.  \n\n“Wait!” called the Prince.  He picked up her glass slipper and rushed out the door.  \n\n \n\nCinderella Story\n \n\nHe looked around but could not see her blue dress anywhere.  “This is all I have left from her,” he said, looking down at the glass slipper.  He saw that it was made in a special way, to fit a foot like none other. “Somewhere there is the other glass slipper,” he said.  “And when I find it, I will find her, too.  Then I will ask her to be my bride!”\n\nFrom hut to hut, from house to house, went the Prince.  One young woman after another tried to fit her foot inside the glass slipper.  But none could fit. And so the Prince moved on.\nAt last the Prince came to Cinderella’s house.  \n\n“He is coming!” called one step-sister as she looked out the window.\n\n“At the door!” screamed the other step-sister.  \n\n“Quick!” yelled the stepmother.  “Get ready! One of you must be the one to fit your foot in that slipper.  No matter what!”\n\nThe Prince knocked.  The stepmother flew open the door.  “Come in!” she said. “I have two lovely daughters for you to see.”\n\nThe first step-sister tried to place her foot in the glass slipper.  \n\n \n\nCinderella Story\n \n\nShe tried hard, but it just would not fit. Then the second step-sister tried to fit her foot inside.  She tried and tried with all her might, too. But no dice.\n\n“Are there no other young women in the house?” said the Prince.\n\n“None,” said the stepmother.\n\n“Then I must go,” said the Prince.\n\n“Maybe there is one more,” said Cinderella, stepping into the room.\n“I thought you said there were no other young women here,” said the Prince.\n\n“None who matter!” said the stepmother in a hiss.\n\n“Come here,” said the Prince.\n\nCinderella stepped up to him.  The Prince got down on one knee and tried the glass slipper on her foot.  \n\n \n\nCinderella Story\n \n\nIt fit perfectly! Then, from her pocket Cinderella took out something. It was the other glass slipper!\n\n“I knew it!” he cried.  “You are the one!”\n\n“WHAT?” shouted a step-sister.  \n\n“Not HER!” screamed the other step-sister.\n\n“This cannot BE!” yelled the stepmother.  \n\nBut it was too late.  The prince knew that Cinderella was the one.  He looked into her eyes. He did not see the cinders in her hair or the ashes on her face.\n\n“I have found you!” he said.\n\n“And I have found you,” said Cinderella.\nAnd so Cinderella and the Prince were married, and they lived happily ever after.",
    "shortDescription": "ONCE UPON A TIME a girl named Cinderella lived with her stepmother and two stepsisters.  Poor Cinderella had to work hard all day long so the others could rest.",
    "level" : "elementary",
    "language" : "english"
  },
  {
    "title": "The Ugly Duckling Story ",
    "source": "storiestogrowby.org",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/300x300.webp",
    "createdDate": null,
    "content": "On a farm long ago, a Mama Duck sat on her nest.  “How long must I wait for my babies to hatch?” she said.  “I have to sit here all alone! And no one comes to visit me.”  But what could she do? A Mama duck must keep her eggs warm till they hatch.  \n\nAt last, the eggs began to crack.  One by one, yellow ducklings stepped out of their shells.  They shook their wings and said, “Quack, quack!”\n“Look at all of you!” said Mama Duck with joy.  “You are all so cute!”\n\n“Quack, quack!” they said.\n\nMama Duck said, “Come and line up.  We will go down to the lake for your very first swim.”  She counted – one, two, three, four, five. “Oh dear!” she said.  “I should have six ducklings!”\n\nBut one large egg was still in the nest. “Well,\" said Mama Duck, \"it looks like that big egg will take more time.” So she had to go sit on her nest again and wait some more.\n\n \n\nThe Ugly Duckling\n \n\nThe next day, the big egg started to hatch.  Out came a baby boy bird. But if one may say so, it was an odd-looking thing.  This bird was much bigger than others. He was not yellow at all - he was dark-gray from his head to his feet.  And he walked with a funny wobble.\n\nOne of the yellow ducklings pointed.  “What is THAT? He cannot be one of us!”\n\n“I have never seen such an ugly duckling!” said another.  \n\n“How can you say such a thing?” said Mama Duck in a stern voice. “You are only one day old!  Your brother hatched from the very same nest as you did. Now line up. We will go to the lake for your very first swim.”\n\nYet the other ducklings quacked, “Ugly!  Ugly! Ugly!” The Ugly Duckling did not know why the other ducklings were yelling at him.  He took the last spot in the line.\n\nEach yellow duck jumped in the river and swam behind Mama Duck.  When it was his turn, the Ugly Duckling jumped in and started to paddle, too.  “At least he can swim,” Mama Duck said to herself.\n\nWhen they left the water and started to play, the Ugly Duckling tried to play with his brothers and sisters, too.  They yelled, “Go away! We will not play with you! You are ugly. And you walk weird, too!”\n\n \n\nThe Ugly Duckling\n \n\nWhen Mama Duck was close by, she would not let them talk in this way.  “Be nice!” she would scold. But she was not always close by.\n\nOne day, one of the yellow ducklings said to the Ugly Duckling, “You know what?  You would do us a big favor if you just went away from here!” All of them started to quack, “Get out!  Get out! Get out!”\n“Why won’t they let me stay here?” said the Ugly Duckling to himself.  He hung his head down low. “Ah, they are right. I should go.”\n\nThat night, the Ugly Duckling flew over the farmyard fence.  He flew till he landed on the other side of the lake.  There he met two grown-up ducks.\n \n\nThe Ugly Duckling\n \n\n“Can I please stay here for awhile?” said the Ugly Duckling.  “I have nowhere else to be.”\n\n“What do we care?” said one of the ducks.  “Just don’t get in our way.”\n\n“Woof! Woof!”  Suddenly a big hungry dog came tearing by, chasing the two ducks.  They quickly flew up in the air, and their feathers fell down on the ground.  The poor Ugly Duckling froze in fear. The dog sniffed and sniffed at the Ugly Duckling, then turned away.  “I am too ugly even for the big hungry dog to want,” said the Ugly Duckling with his head hung low.\n\nThe sky turned dark.  Crack!  A bolt of lightning.  Then came a big storm, with heavy rains pouring down from the sky.  In just moments, the Ugly Duckling was soaked through and through. Then a cold wind started to blow.\n\n“Brrr!” he said with both wings held close to his chest.  “If only there was a place I could get dry.”\n\nAll at once, a tiny light blinked far off in the woods.  “Could it be someone’s hut?”\n\nHe flew to the door.  “Quack?” said the Ugly Duckling.  The door of the hut creaked open.\n \n\n\n\n \n\n“What is all this noise?” said an old woman, looking right and left.  Her eyes were not that good. Then she looked down. “Ah, look at that, it’s a duck!”  She picked up the Ugly Duckling and dropped him inside her hut. “You can stay here, but only if you lay eggs,” she said.\n\nA tomcat and hen crept up to the Ugly Duckling.  “Who do you think you are, coming in here and taking up room by the fire!” said the tomcat.  \n\n“Squawk!” said the hen.  “I do not need anyone else in this hut laying eggs.”\n“Do not worry about that,” said the Ugly Duckling.  “I am a boy duck.”\n\n“Then why are you still here?” said the tomcat.  “Did you not hear what the old woman said?”\n\n“Get out of here, pretender!” clucked the hen.  \n\n“Get out!  Get out!“ hissed the tomcat.\nThe door was still a bit open, so our poor Ugly Duckling slipped out the door, and back into the storm.\n\n“No one ever wants me,” said the Ugly Duckling with a tear in his eye.  \n\n \n\nThe Ugly Duckling\n \n\nThe storm ended.  Soon he found a new lake.  Looking into the water, the Ugly Duckling saw the reflection of a flock of large white birds flying.  He looked overhead and could not believe what he saw. There, above him, were the most beautiful birds he had ever seen!  Their long white bodies and slender necks seemed to just glide through the sky. He watched until the very last bird had winged its way out of view.  \n\nHe stayed at that lake all by himself, and time passed.  The leaves of the trees turned deep red and gold, and then the leaves fell to the ground.  Winter came, setting a blanket of white snow all over. The cold wind and the dark clouds made the Ugly Duckling feel even more sad.\n\nHe had to go into the cold, cold lake to fish, but it was getting harder to swim.  The lake was turning to ice. One day, it was all he could do was to paddle the water to keep it from freezing around him, and trapping him in the lake.\n“I am so tired!” he said, paddling with all his might.  The ice got thicker and drew closer to him.\n\nIn a moment, two giant hands swept him up.  “You poor thing!” said a farmer. He held the Ugly Duckling close to his thick wool jacket and took the bird to his home.  \nNever was a warm fireplace more welcome!  For the rest of the winter, the farmer cared for the Ugly Duckling.  Then spring came. Tips of green covered the trees. Short, bright flowers popped up from the ground.  \n\n“It is time for you to go to the lake to swim again, as you were born to do,” said the farmer.  He took the duckling back to the lake where he had found him, and set him with care on the water.\n\n“Gosh, I feel strong,” said the young bird, flapping his wings.  “Why, I never felt as strong as I do right now!”\n\nHe heard quiet splashing sounds behind him, and turned around.  A flock of those same beautiful birds he had seen in the sky before landed behind him on the water.\n\n“Do not worry!” he said to them, holding out one wing.  “I will go now. I will not make trouble for you.” A big fat tear rolled down his cheek.  He turned to go away. When he opened his eyes, he saw a reflection in the water of one of those beautiful white birds.  Why was it so close to him? He jumped back. And the reflection jumped back, too.\n\n \n\nThe Ugly Duckling\n \n\n“What is this?” he said.  He stretched his neck, and the reflection of the beautiful bird stretched its neck, too.\n“Why are you going so soon?” said one of the beautiful birds.  \n\n“Stay here, with us!” said another.  “We’ll be great friends.”\n\nThen, the bird who used to be the Ugly Duckling knew what had happened!  He was no longer an ugly gray bird that wobbled when it walked. \n\nAt one moment, all the swans flapped their wings and took off into the sky. “Come with us,” one called back. “Take the lead!” So he flapped his wings fast and took his place in front of the whole flock.  All his new friends flapped their wings behind him.\n\n“Say!” he said, gliding and dipping through the sky as he sped on.  “Who’s an ugly duckling now? Surely, Not I!”",
    "shortDescription": "On a farm long ago, a Mama Duck sat on her nest.  “How long must I wait for my babies to hatch?” she said.  “I have to sit here all alone! And no one comes to visit me.”",
    "level" : "elementary",
    "language" : "english"
  },
  {
    "title": "The Sword in the Stone",
    "source": "storiestogrowby.org",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/Sword_Stone_Final5.webp",
    "createdDate": null,
    "content": "Long ago in England, a wise and just king ruled the land.  His name was King Uther. Times were good and the people lived well.  King Uther wanted a magician at court. And so he chose the famous Merlin the Magician.  Merlin could see into the future. And he knew those good days were not going to last.\n\nKing Uther and the Queen Guinevere had a child, a baby son.  \n \n\n\n \n\nAt a castle party for the royal birth, Merlin the Magician took the King aside.  He said, “Sire, there is something you must know. Soon a great darkness will fall over this land.  Your child is in great danger. Let me take the baby far away. I will be sure he stays safe.”\n\n“Merlin!” said the King in surprise. “You are a great magician.  And you are my friend. But there is no way we would let anyone take our child away!”\nSadly, soon after the child’s birth the Queen died.  Not long after, King Uther was killed in battle. That very night, Merlin swept into the castle and took the child.  \n \n\n\n \n\nThe next morning, the royal nurse went into the nursery. Alas, an empty crib! In fear, the nurse, the nobles and servants looked everywhere.  But the baby was gone!\n\nFor years, there was no king to sit on the throne.  No king to set the laws. Men of high rank fought each other to be king.  Darkness fell over the land. Robbers and bands of wild men ruled the streets of London.  Evil men broke into houses and took what they wanted. Travelers on the roads were jumped and robbed.  The people of England lived in fear.\n\nYet far away, there was a quiet place.  A good knight, Sir Ector, lived in peace with his two sons.  His first son was named Kay. His younger son Arthur had been adopted as a baby.  Years before, a stranger had come to Sir Ector with a baby. He asked if Sir Ector would raise the child.  The old knight took the baby in his arms, glad for a second child. He named the baby Arthur, and raised the child as his own.\n \n\nThe Sword in the Stone King Arthur Legend of the Sword Story\n \n\nWhen Arthur was ten years old, the same stranger returned to Sir Ector’s home.  He could read and write, and so Sir Ector hired him to teach his two sons. Kay could not sit still for lessons and he stopped coming.  But Arthur listened with wide eyes. He learned everything. I bet you have guessed by now who that stranger was – none other than Merlin the Magician!  \nAt the end of each day when Arthur finished his chores, that was time for the lessons.  Merlin would sit with Arthur for hours and teach him about the world. Arthur was a thin lad, not strong like his big brother Kay.  Merlin said not to worry about that. He said what mattered most was to have a heart that was big and strong. Merlin saw how the birds, foxes and deer followed Arthur.  He could see that the boy had a very big and strong heart.\n\n \n\n\n \n\nBy the time Arthur was 16, his brother Kay had become a knight.  He was now called Sir Kay. Arthur loved nothing more than to serve his brother as a squire.  He kept great care of his brother’s tunic and helmet, his spears and lances.\n\nOne day at lesson time, Merlin looked away.  He stood up.\n“What is it?” said Arthur.\n\n“The people need hope,” said Merlin.  “Arthur, there is something I must do.  I must go now.”\n\nThat night, when the nighttime was at its most dark, Merlin the Magician came to London’s market square.  He stood in the middle of the square. He held both his arms high. And pointed his wand to the stars.\n\n \n\n\n \n\nThe next morning at dawn, people started to arrive at the market.  There in front of them was something most odd. A block of white marble stood in the middle of the town square.  Resting on the block was a giant stone the size of a very large rock. At the very top of the stone there was a golden sword handle and a few inches of the blade, shining in the sun.  Yet – this was most odd – the rest of the blade was buried deep into the stone. None of this was there the day before!\n\nWhat’s more, these words could be seen on the top of the blade:\n\n \n\n“Whoever pulls out this sword from this stone is the true king of England!”\n \n\nAs soon as the crowd knew about the message, men jumped up to that white marble block. One after another, they gave the sword a yank. Each tried and tried, but the sword stuck fast. It would not move.\n\nOne said in gloom, “There is no man alive who could pull out that sword!”\n\n“We’ll see about that!” said a voice in the crowd.  The Duke of Cornwall, dressed in silks and ribbons, stepped up to the white marble block.  “Hear ye, hear ye!” he said. “I call for a tournament to be held, one month from today. Knights from anywhere and everywhere in England are invited to come.  There will be contests and prizes. And a grand feast for all!” The Duke said to his wife, the Duchess, “If I know men, this tournament will draw the strongest, finest knights in all of England!”  \n\n \n\n\n \n\nSaid the Duchess, “Good idea, my dear.  All we need is one knight who is so strong he can pull that sword from the stone.  Then we will have a king again, at last!”\n\nThe people danced and cheered.  At last there was something to feel happy about! News of the tournament traveled fast.  From castle to village, to every far corner of the land. At last, word got to the far-away home of Sir Ector.  Sir Kay heard the news when he was polishing his helmet.\n\n“Arthur!” he called out.  Arthur was once again by the woods, feeding birds from his hand.  He set down a pile of seeds for the birds, and a pile for the squirrels.  Then he ran fast to see his brother.\n“There you are!” said Kay.  “There will be a tournament in London.  We must set out at once!”\n\nWhat great news! Arthur had never been more than a few miles from home.  He would be the best squire ever for his brother! Arthur ran back to the house.  In the courtyard his father was getting the horses ready.\n\nSir Ector and his two sons rode through London on their way to the tournament.  Riding through the market square, something shiny glinted in the sun. “That sword looks like it goes right into that stone,” said Arthur.  “But how can that be? That’s impossible.” But why were guards standing all around it?\n\nThe father and his two sons reached the tournament. Sir Kay ran off to get in line to register.  Sir Ector greeted many old friends – dukes, earls, barons, counts and countesses. Arthur sat in their tent, polishing his brother’s helmet till it shone bright.\n\nA bugle sounded.  The tournament was about to begin! “Get my sword, demanded Kay”  \n\n“Right away,” said Arthur.  But where was it? Arthur looked around in panic.  Kay’s spear, battle-axe, and dagger were right where they should be.  But no sword. “Kay…” he said, “how about a battle-axe?”\n\n“Where is my sword?!”  \n\n“I'll have it in a moment!” said Arthur. \n\n \n\n\n \n\n“Be quick about it!” said Kay.\n\nArthur ran back into the tent.  Maybe he had left Kay’s sword there?  He searched through the bag of armor and weapons.  How could he let such a thing happen? Then he had an idea.\n\nVery fast, Arthur rode back to the market square.  The guards were not there anymore – they must have all gone to the tournament.  \n\nArthur stepped up on the marble block.  “Let’s see if that sword can get unstuck.”  He took hold of the handle of the sword. He moved the sword a bit.  “Hey!” he said. “It’s looser than I thought.”\n\nWith one big tug, the sword slid out.  \n\n \n\nThe Sword in the Stone King Arthur Legend of the Sword Story\n \n\nArthur was thrown back, but the sword was safe in his hands.  “I will be sure to bring it right back.” He raced to the where his brother was waiting.\n\n“Here it is,” he said, handing the sword to his brother.\n\nKay took one look.  “Oh!” he said in surprise.\n\n“What is it?” said Arthur.  But his brother was gone. Soon after, he heard his brother’s voice outside the tent.  “Father, I have something to show you.” Kay and his father stepped inside the tent. \n\n“Look!” said Kay.  He pointed to the sword.\n\nSir Ector stared.  His face turned white.  “Kay,” said the father, facing his older son, “where did you get this sword?”\n\n“It is mine!” said Kay, holding it close to him.  “I have it now.”\n\n“Kay!” said the Father again in a stern voice.  “I will ask you one more time. Where did you get this sword?”\n\nThe young knight’s head dropped down.\n\n“From Arthur,” he said.  “He lost my sword! Somehow he got this one.”\n\n“Arthur?” The father turned to his younger son.  “How is it that you came by this sword?”\n\n“I’m sorry!” said Arthur.  “Father, I will put it back right away.  I only meant to borrow it when I pulled it from the stone.”\n\n \n\n\n \n\n“You must take us to where you found this sword.  At once!” The three of them rushed over to the market square.\n\nArthur climbed up onto the marble block.  “It came from here,” he said. He lifted the sword over his head.  \n\nThen he dropped the blade back into the stone. “Now it’s back.”\n\n“Hey,” said Sir Kay.  “I still need a sword!”  He jumped up onto the marble block.  Grabbing the hilt of the sword, he pulled and pulled.  But it did not move.\n\nKay shouted to Arthur, “What did you do to it?”\n\n“Nothing!” said the lad.\n\n“You must have done something!” yelled Sir Kay.\n\n“Hush! Both of you!” said the father.  “It is better if no one sees or hears us.”\n\nBut it was too late.  A crowd had already started to form.\n\n“Hey! Did you pull that sword out of the stone?” called one.\n\n \n\n“Yes,” said Arthur. “I did.”  \n\n \n\n“Do it again!” called another from the crowd.  \n\n“Yes, let’s see it!”\n\nArthur put his hands around the golden handle.  With one tug, the blade slid out.\n\n“Who are you?” called another voice. “What’s your name?”\n\n“Arthur,” said the lad.\n\n“Wait a minute, put that sword back!” A tall knight pushed forward from the crowd.  “Anyone can pull it out, once it’s been pulled!”\n\n“Go ahead.  Put it back, son,” said a voice.  It was the Duke of Cornwall, the one who had called for the tournament.\n\n“All right,” said Arthur. He slipped the blade back into the stone, with ease.\n\n“Let me at that now!” said the tall knight.  He jumped up and grabbed the handle of the sword.  But pull and tug as he might, the sword would not move.  Not even a bit.\n\nAnother knight tried.  Then another. But no one could move the sword. Some waited, thinking the longer they pulled the sword, the looser it would get.  But when each man took their turn, the sword did not move for them.\n\n“Let the lad try now,” said the Duke of Cornwall.  “Arthur, go ahead.”\n\n \n\nArthur stepped up to the stone again.  In one motion he freed the sword. This time, he held it high above his head.  The blade flashed in the sun. Amazed, the crowd did not know what to think.\n\n \n\nOne called out at last.  “He must be our new king!”\n\n“We have a king!” called another. “At last!”\n\n“Stop!” shouted the tall knight.  “Do you really think this skinny boy should rule over all of us?”\n\n“Yes!” said a voice.  All eyes turned around.  It was Merlin the Magician.\n\n“I know this boy. I know his heart.  There is no one in England who has a heart that is bigger and stronger than his.  The sword has told us this young man is to be the next king of England. And there is something else!”\n\n“The lad,” said Merlin, pointing to Arthur, “is the true child of King Uther.  He is the missing baby!”\n\nCheers began to ring out.  “Hail, King Arthur!” called someone from the crowd.  \n\nSir Ector fell to his knees.  Then Sir Kay. One person after another fell to their knees, too.  All cheered. At last, a king had been chosen. A fresh young king, and a new day for England!",
    "shortDescription": "Long ago in England, a wise and just king ruled the land.  His name was King Uther. Times were good and the people lived well.",
    "level" : "elementary",
    "language" : "english"
  },
  {
    "title": "The Story of Pocahontas and John Smith",
    "source": "storiestogrowby.org",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/Pocahontas11.webp",
    "createdDate": null,
    "content": "In the spring of 1607, three ships landed on the shore of what is now America.  About 100 men – no women were asked to come – stepped onto the sand to start a new life. \n\n \n\nPocahontas\n \n\nThe men built 20 cabins and a fort to go around them all.  They called their new town Jamestown.   But they were not the only ones living on that land.\n\nUp and down the coast and for miles into the woods lived tribes of Native Americans.  Today, the area is called Virginia. \n\n \n\n\n \n\nBack then, it was called the Powhatan Confederacy.  Over 30 tribes in the Powhatan Confederacy were ruled by one chief.  His name was Powhatan. \n\nChief Powhatan’s scouts told him that new men had landed on the shore.  They told him the men had built a fort.  They also told him the new men spoke in words no one had heard before.  They wore clothes no one had seen before. \n\n \n\n\n \n\nPowhatan knew all that.  What he did not know – and what he wanted to know most of all - was, where did they come from?  Why were they here? And what would it be like to be their Chief?\n\n\nHis scouts told him some other news, too, that was most odd.  No crops had been planted around the fort.\n\nNo canoes were anywhere near the fort, and the men did not even stand by the river to fish.  The men did not go into the woods to hunt, either. Said Powhatan, “These men do not know how to plant, ride a canoe, fish or hunt.  It will be easier than I thought to be their Chief.\n \n\n\n \n\nWe will bring food to them – corn, beans and squash. Without us, they will starve.  And I, Powhatan, who rules 30 tribes, will rule over them, too!”\n“Father let me come with you!” said Powhatan’s daughter Pocahontas.  No one had seen her slip into the longhouse. “I want to see the fort, too.” “Surely not!” said her father.  “You have work to do here.  When you are done, you may play with your sisters.”\n\n \n\n\n \n\n\n “I play with them every day!” said Pocahontas.  “Father, please! I’ll be good!”   Powhatan smiled. \n\n“Ah, my princess,” he said.  “How can I say no to that face?” At last, an adventure for Pocahontas!  She felt sure that if she had to sew beads onto one more moccasin, or fill one more basket with berries, she would burst! So Chief Powhatan, with scouts carrying baskets of corn, beans and squash, and with Pocahontas beside them, all went over to the fort.\n\n \n\n\n \n\nWhen they got there, they set down the baskets.  And stepped back. In a minute, men burst out of the fort with big smiles on their faces.  You can be sure there was much joy! Pocahontas saw something else that made her smile, too.  Four boys a bit older than she came out with the other men.  She waved to the boys.  They waved back!  When the grown-ups were trying to talk to each other with their arms and hands, she said to them, “Want to play?”  \n\n \n\nPocahontas\n \n\nThey did not understand her words.  But soon they were showing her how to play tag and stickball.  And she was showing them how to do cartwheels. After a while, Powhatan called, “Pocahontas! It’s time to go.” Every four or five days after that, Pocahontas came back with the others to the fort. Each time, Powhatan’s scouts carried corn, squash, and beans.  Sometimes for a special treat, maple sugar, too.  Pocahontas learned the names of her new friends – James, Nathaniel, Richard and Samuel. And they learned hers.  She also learned the name of their leader, John Smith.\n\nAs the days got shorter, the rain stopped coming. The corn in the fields dried up.  The squash and the beans on the vine dried up.  Berries on the bushes dried up. “We cannot take food to the fort anymore,” said Powhatan.  “We need to save all we have so our people will make it through the winter.  We must go to the fort and tell them.”\n\n \n\n\n \n\nWhen the men in the fort heard the news, they got angry.  They marched into their cabins.  They came out with guns, and shot the guns into the sky. Powhatan got angry, too.  He said, “I warn you, white men!  Do not go anywhere near our village!  If you do, you will be sorry!”  The men of Jamestown could not understand what Powhatan was saying.  But they could tell from his face that they were not friends anymore.\n\n \n\n\n \n\nSoon after that, John Smith was going through the woods looking for food.  He was close to the village of Powhatan.  Too close.  Powhatan’s brother and some of the tribe saw him pass.  In a flash, they jumped out at him.  They held John Smith down and took him back to Powhatan’s village. “Now it will be done, once and for all,” said Powhatan.  “I will be Chief to all the people in the fort.”\n\nThat winter, John Smith could not leave the village.  Still, Powhatan made him feel at home.  Pocahontas, who knew him from before, spent time with him.  Day after day, they would teach each other the words that each other’s people spoke. \n\nAs the snow melted, the people of Powhatan’s village started to get ready for a festival.  Powhatan called John Smith into his longhouse.  “The festival will soon be here,” he said. “What festival?” said John Smith.  Now he could better understand what Powhatan was saying. “The festival to mark the time when your people join my people.  When I become your Chief.” “That will never happen!” shouted John Smith. Powhatan did not know the words the young man was saying.  But the Chief could tell that John Smith was angry.  “Your people have no choice!” said Powhatan. “If you will not join my tribe, you must die!”\n\n \n\n\n \n\nNo one saw Pocahontas slip into the longhouse.  Powhatan said: “Put his head on the rock!” Two strong braves grabbed John Smith and pushed his head down on a rock.  Powhatan lifted a large rock above him, ready to strike. “No!” the girl cried out.  All of a sudden, Pocahontas rushed up and bent over John Smith, placing her own head over his. \n \n\n\n \n\nPowhatan held the rock high in the air. “Pocahontas!” he cried out.  “Move away!” “I will not move!” she said, turning her head to the side.  “Let him be.  Let all of them be!” Powhatan held up the rock.  Then, he lowered his arms.  “My daughter,” he said in a soft voice. “You are right.  No good can come from hurting these people.”\n\nAfter that, Powhatan set John Smith free.  Powhatan’s tribes brought food again to the men in the fort, this time smoked meat and fish. ",
    "shortDescription": "In the spring of 1607, three ships landed on the shore of what is now America.  About 100 men – no women were asked to come – stepped onto the sand to start a new life.",
    "level" : "elementary",
    "language" : "english"
  },
  {
    "title": "Snow White and the Seven Dwarfs",
    "source": "storiestogrowby.org",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/Snow-White-and-the-Seven-Dwarfs-Cover.webp",
    "createdDate": null,
    "content": "Once upon a time, a princess named Snow White lived in a castle with her father, the King, and her stepmother, the Queen. Her father had always said to his daughter that she must be fair to everyone at court. Said he: “People come here to the castle when they have a problem. They need the ruler to make a fair decision. Nothing is more important than to be fair.”\nThe Queen, Snow White’s stepmother, knew how much this meant to her husband. At the first chance, she rushed to her magic mirror.  “Mirror, mirror, on the wall,” said the Queen.  “Who is the fairest of them all?”\n\n \n\nSnow White and the Seven Dwarfs\n \n\n“Snow White is the fairest of them all!” said the Magic Mirror.\n “What?!” yelled the Queen.  “No one is more fair than I!  The Queen must have the best of everything - everyone knows that.  What could be more fair?”\n“Snow White is the fairest of them all!” repeated the Magic Mirror.\n\n “What do you know – you’re a mirror!” roared the Queen.  And she stormed off. \n\nStill, the Queen was bothered.  So bothered was she that the Queen decided to be rid of the girl, once and for all. \n\n“I cannot wait another day!” she declared.  The Queen called for her servant, a huntsman.  “Find a reason to take Snow White deep into the woods,” she said, pointing her long finger at the servant. “Then kill her.”\n\nThe huntsman was shocked!  But she was the Queen and what could he do?  The next day he took Snow White into the woods.  As he drew his knife to slay her, Snow White turned around.\n\n \n\nSnow White and the Seven Dwarfs\n \n\n“Look,” she said, taking something out of her pocket.  “You have always been good to me.”  She held in front of him six perfect arrowheads that she had carefully shaped. “Do you like them?” she said.  “They are for you.”\n\n“Snow White,” said the huntsman.  “I cannot do this!”\n“Of course you can take these,” said Snow White.\n\n\"That's not what I meant,\" said the servant.  He dropped to his knees.  “How can I say this to you?  The Queen, your step-mother, ordered me to kill you,” he said.  “But I cannot!”\n\n“She did what?” Snow White called out with alarm.\n\n“You must run away!” said the huntsman.  “Far into the woods.  Now!  And never come back to the castle!”\nSnow White turned and ran into the woods as fast as she could.  Deeper and deeper she ran.  It was getting dark, and the wolves were starting to howl.  She tripped and her skirt was torn.  Tall tree branches seemed to reach down to the very ground to grab her.  She was scratched, bleeding and scared.  Yet she ran on and on.\n\nThen all of a sudden, far away, there was a light.  Who was living so deep in the woods?  She stepped up closer.  It was a cottage!  Yet no sound came from the cottage, only light from the windows.\n \n\nSnow White and the Seven Dwarfs\n \n\n“Hello?” she said, knocking softly on the door.  “Hello?” No answer.  The door was a little bit open.  She opened it some more and stepped in.  “Hello, is anyone home?” \n\nShe looked around.  What a mess!  She had never seen a messier living room.\n\n“This cottage may be the biggest mess I ever saw,” she thought.  “But it's a roof over my head for tonight. Maybe if I clean up around here, I can earn my sleep.”\n\nAs she cleaned, she thought of someone she already missed.  Before her father had re-married, she and a Prince who lived in the next kingdom were getting to know each other.  They would take long walks in the royal garden and tell each other stories, and laugh.\n\n \n\nSnow White and the Seven Dwarfs\n \n\nAfter the Queen had moved into the castle, her stepmother had made a new rule – no more visitors.  Now the Prince had to slip over the palace gate in secret. He would call out to her from under her window and they could talk a bit that way. It wasn’t as good as the long walks but it was the best they could manage.  \n\nNow that she had to run away from home, would she ever see him again?\n\nAfter Snow White cleaned up the living room, she went upstairs.  On the second floor, there were seven little beds lined up in a row, as if for children.  Tired from cleaning, Snow White yawned and lay across all seven of the beds.  Soon she fell fast asleep.\n\n \n\n\n\n \n\nIn the meantime, the Seven Dwarfs were heading home from a long day of working in the jewel mines.  When they opened the door, you can imagine their surprise when they saw their cottage all cleaned up!\n\n“What kind of magic is this?” said one of the Dwarfs, whose name was Doc.\n\n“I wouldn’t mind more magic like this!” said another of the Dwarfs with a smile.  His name was Dopey.\n\n“We'd better check upstairs,” said another Dwarf, whose name was Grumpy.  “Something is fishy around here, that’s for sure.”\nThere – lying across all their beds, was a young lady, fast asleep. \n\n“Who are you?” said all the Dwarfs at once. \n\n \n\nSnow White and the Seven Dwarfs\n \n\nSnow White bolted awake.  The Seven Dwarfs could tell she was as surprised as they were.  Soon they all relaxed and shared their stories. \n\nSnow White learned their names – Bashful, Doc, Dopey, Grumpy, Happy, Sleepy, and Sneezy. She told them all about her step-mother.  That her stepmother had tried to get the huntsman to kill her, that the huntsman had set her free in the woods, and that she could never go back home again.\n\n“Stay here, with us,” said Bashful. \n“That’s sweet,” said Snow White.  “But if I were to stay here at your home, I would have to do something for all of you.”\n\n“You already cleaned up our place,” said Sneezy. \n“Keeping the house clean will be easy,” said Snow White, “as long as we all pitch in.  I will let everyone know what part they can do, and I will do my share too, of course.”\n\n“That’s fair,” said Happy.\n\n“But there must be something else I can do for you,” said Snow White.\n\nThe Seven Dwarfs shrugged.\n\n“Do you know how to read?” said Doc.  \"We have these books filled with wonderful tales and would love to be able to read them.\" And so it was agreed that Snow White would teach them how to read.   \n\n \n\nSnow White and the Seven Dwarfs\n \n\nTo celebrate their new friendship, Snow White and the Seven Dwarfs sang and danced the night away. \nThe next morning before they left for work, the Seven Dwarfs warned Snow White she must not open the door to anyone.  After all, who knows what evil her stepmother might do?  The princess nodded in agreement, and the Dwarfs left the house.  The princess prepared her first reading lesson. She also prepared a good hot meal for the Seven Dwarfs when they returned home that night.  And so the days passed.\n\nBack at the castle, the Queen marched up to her mirror.  “Mirror, mirror on the wall,\" she demanded.  \"Who is the fairest of them all?”\n\n“Snow White is the fairest of them all!” said the Magic Mirror.\n\n \n\nSnow White and the Seven Dwarfs\n \n\n“That’s impossible!” screamed the Queen.  “The girl is no longer alive!”\n\n“Snow White lives!” said the Magic Mirror.  And an image was shown on the mirror of Snow White living in the cottage of the Seven Dwarfs.\n\nThe Queen turned red with rage.  She screamed, “Who does she think she is?!  Snow White will not get away with this!”\n\nAt the cottage of the Dwarfs the next afternoon, when the Seven Dwarfs were away at work, there was a knock on the door.\n\n“Who is it?” said Snow White.  She remembered the warning of the Seven Dwarfs not to open the door to anyone.\n\n“It’s only a poor old woman,” came a squeaky voice, “selling apples.” Yet it was the evil Queen, disguised as an old woman.  “It’s raining out here, my dear,” said her voice through the door.  “Please let me in.”\n\n“Poor thing,\" thought Snow White, \"having to go door to door selling apples in the rain.\"  And so she opened the door.\n“Take a look at this big red apple,” said the old woman, who as you know by now was really the Queen in disguise. She held the red apple close to Snow White’s face.  “Lovely, my dear, isn’t it?”\n\n \n\nSnow White and the Seven Dwarfs\n \n\n“I would like very much to buy your apple,” said Snow White. “But I have no money.”\n\n“That fine comb in your hair will make a good trade,” said the old woman.\n\n“Well, all right then!” said Snow White.  She took the comb out of her hair and gave it to the old woman, who then gave her the apple.  Snow White took a big bite.  Alas, the fruit was poisoned!  At once, Snow White fell to the ground in a deep sleep. \n“YES!” shouted the Queen, pumping the air with her fists. \n\nJust then the door flew open.  In marched the Seven Dwarfs, home from the day's work.  Shocked indeed they were to find Snow White lying on the floor and what must be her stepmother beside her, laughing!\n\nThey chased that evil Queen out the door, and into the storm.  Up to the very top of a mountain they chased her.  All of a sudden, lightning hit the mountain!  The Queen fell, and she was never seen again.\n\nBut there was nothing to help poor Snow White.  She stayed absolutely still in her deep sleep.  The Seven Dwarfs gently lifted her into a glass coffin.  Day and night they kept watch over her.\n\nOne day, the Prince happened to pass through.  Ever since he had learned that Snow White was missing at the castle, he was searching for her, far and wide.  Now he had finally found her, but in such a state! The Prince pulled open the glass coffin.  Her face seemed so fresh, even in that deep sleep. \n\n \n\nSnow White and the Seven Dwarfs\n \n\nHe gently took one of Snow White's hands in his own and kissed it.  At once, Snow White’s eyes opened!  With Love's First Kiss, the evil Queen's spell was forever gone. Now nothing stood in the way for Snow White and the Prince to be together forever.  They returned to the Prince's kingdom and lived happily ever after.",
    "shortDescription": "Once upon a time, a princess named Snow White lived in a castle with her father, the King, and her stepmother, the Queen. ",
    "level" : "elementary",
    "language" : "english"
  },
  {
    "title": "Sleeping Beauty Fairytale",
    "source": "storiestogrowby.org",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/Sleeping-Beauty_7.webp",
    "createdDate": null,
    "content": "Long ago in France there lived a King and Queen.  More than anything, they longed for a child.  At last, to their great happiness, the Queen gave birth to a little girl.  All the bells in the land were rung with joy. \n \n\n\n \n\nThe King and Queen invited all the fairies in the kingdom to the Naming Party for the baby.  And what a party it was!  Plates and silverware of pure gold were set with care before each guest. But one fairy, Maleficent, who had left 50 years before and had not been seen in all that time, showed up at the door.  Quickly the King and Queen found a place setting for the new guest.  But alas, the plate and the silverware were not of pure gold.  This made the old fairy very angry.\n\nSoon it was time for each Fairy to give her blessing to the baby.  When it came to Maleficent’s turn, she stood up and pointed her long finger at the sleeping baby girl in the cradle.\n“I declare, before all of you,” Maleficent called out, “that this child, on her 16th birthday, shall prick her finger on the spindle of a spinning wheel, and die!”\n\n \n\nSleeping Beauty\n \n\nWith a whoosh of smoke, the evil fairy vanished.  Everyone cried out with alarm, as you can imagine.  But one fairy had not yet given her blessing.  The King and Queen asked this fairy, whose name was Merryweather, to reverse the curse.  Merryweather shook her head sadly –  that was not possible.  But she could soften the curse. \n“On her 16th birthday,” she said, “when the princess pricks her finger on the spinning wheel, instead of dying she will fall asleep for 100 years.”\n“One hundred years!” said the Queen.  “After our daughter turns 16, we will not know her anymore!”\n\nThe King ordered every spinning wheel in the kingdom to be brought to the palace and burned.  To be extra sure the princess would not be anywhere near a spinning wheel, he also ordered the fairy Merryweather, along with two other fairies, Flora and Fauna, to take the baby far away. \n\n \n\nSleeping Beauty\n \n\nThe fairies would raise the child in a cottage, deep in the woods.  There, they would keep her safe until after her 16th birthday.  After that day it would be safe to bring back the princess, who had been named Aurora, to the castle.\nAurora grew up knowing no others than the three fairies, whom she knew as her aunts.  The animals of the forest were her friends. \n\nThe birds and the deer, the chipmunks and the rabbits, followed her around as she fed them treats and cooed to them. \n\n \n\n\n \n\nFrom the time she was little, Aurora was told she must stay inside the hills that surrounded them.  She did not mind that in the least.  The woods were wide and deep inside the hills, and there was plenty of room for her to play.\n\nOne day, Aurora came home to the cottage to find her three aunts preparing for a party.  “What’s going on?” she said.\n\n“Tonight we will celebrate your 16th birthday!” said Flora. \n“It is?” said Aurora.  “That means tomorrow I go back to the castle!”\n\n“Yes!” said Merryweather.  “We have kept you safe from that spinning wheel for 16 years. Soon it will be time for you to take up your royal life as a princess.”\n “And the first thing for you will be to get married,” said Fauna.\n\n \n\n\n \n\n“Married, already?” said Aurora.  “Do you know who I’m supposed to marry?”\n\n“We do,” said Fauna with a wave of her hand, “but there’s no need to worry about that.  Even if he’s a bit strange, some might say a bit horrid,  you won’t have to spend much time with him,after all.”\n\n“And he does come from a fine family,” Flora added with a quick smile.\n\n“Wait a minute!” said Aurora, pulling back.  “Why do you say he’s a bit horrid?”\n\n“It’s best not focus on such things, dear,” said Merryweather. \n\n“Just do everything your husband tells you to do,” said Flora, “and you will be fine.”\n“This is not turning out like I thought!” cried Aurora.  “How long do I have to stay married?”\n\n \n\n“For the rest of your life, of course,” said Fauna.\n\n \n\n“No, no, this is all wrong!” cried Aurora.  She turned away, then said in a firm voice,  “I would rather prick my finger on a spinning wheel and fall asleep for 100 years than have to marry someone I don't want to marry! Maybe by the time I wake up, people won’t have to get married if they don’t want to!”  And she ran out the door.\n\n“Dear me,” said Merryweather to the other two fairies.  “I don’t believe that went over very well.”\nAurora ran deep into the woods where her animal friends lived. \n\nA deer hopped beside her, along with the rabbits and chipmunks.  “We have to get out of here,” she said to all of them. Then pointing to a mountain pass, she said, “We will go right through the hills.”\n\nSoon Aurora came to a road.  In the distance was a carriage, coming closer to her.  As the rider approached, her animal friends scattered.\n\n“Hail!” said the stranger.  “I’m afraid my carriage scared away your pets.  May I give you a lift?”\nAurora had never seen a man before.  But she couldn’t think about that – unless she could find a spinning wheel, the very next day her aunts would take her back to the palace. \n\n“Actually,” said Aurora to the stranger, “there is something I need a great deal.”\n\n“What’s that?” said the stranger, hopping out of the carriage.  Very nicely dressed was he, and well mannered, too.\n\n \n\nSleeping Beauty\n \n\n“A spinning wheel,” said Aurora.\n\n“A spinning wheel!” said the stranger.  “But there are none left in the land – everyone knows that.”  \n“Well, you see,” said Aurora, rubbing her hands together, “I have this friend.  She needs a spinning wheel in the worst way.”  Aurora looked directly at the stranger.  “It’s a matter of life or death.”\n\nThe stranger looked at Aurora’s eyes.  At last, he said, “I may know of one,” he said.  “But this needs to stay between you and me.”  The stranger stepped closer. \n“Not far from here lives an old woman who spun yarn all her life.  When the orders came to burn all the spinning wheels, she could not bear to let go of her beloved spinning wheel since it had been in her family for many years.  She came to me,” he said, pointing down the road, “as I’m a prince from the next kingdom. She begged me to let her store it away safely. So I put it in the attic room of my castle tower, where no one ever goes, until the 16 years had passed.”\n\n \n\n“Would you take me to your castle tower?” said Aurora.\n\n \n\n“I shouldn’t,” said the prince.  Then after a moment, he said, “But I will.”\n\nShe stepped onto his carriage.  Soon they were at the tower, and they both stepped out.  The prince said, “This is not for your friend, is it?”\n\n“Thank you for taking me here,” said Aurora.  “I will always remember your kindness.  Now if you please, I must do what I must do.”\n\nAurora turned and went up the tower stairs to the very last stair.  The door in front of her creaked open.  Inside, all was dark and musty.  She could barely take a step for all the spider webs. \n\n \n\n\n \n\nBut she pushed them aside and stepped forward. There, in a far corner, was the spinning wheel.  From a small window, she could tell the sun was already setting.  “I hope this works,” she said, “before it’s too late.”\n\nAurora held out her finger to the tip of the spindle.  She pricked her finger on that spindle.  One tiny droplet of blood dripped from her finger. At once, Aurora felt dizzy.  She fell onto an old dusty velvet blanket that lay on the attic floor, and fell into a deep sleep.  Moments later, all the others in the castle, servants and royals alike, fell asleep too, and so did the prince, who was still waiting for her outside the tower.  Within hours, thorns and vines had sprung up and wrapped around the castle, so thickly that no human or beast could pass through.\n\n \n\nFor 100 years, Aurora and the others slept. \n\n \n\nAfter 100 years had passed, Aurora blinked her eyes awake.  Then all the others in the castle also awoke.  Everyone started to do what they had been doing when they had fallen asleep 100 years before. The thorns and vines around the castle melted away.\n\nAurora stepped down the tower stairs to find the prince.\n\nTogether, they stepped into the prince’s carriage.  Down the road to the market square, they discovered a whole new world.  Bicycles and streetcars, cameras and streetlights – such marvels to behold! \n\nPerhaps best of all, they learned that in this strange new time, it was quite all right for young women and men to get to know each other, if that’s what they wanted to do, and even perhaps to fall in love. \n\n \n\nSleeping Beauty\n \n\nAs Aurora and the Prince took each other’s hand to explore this wonderful new world together, that is exactly what they wanted to do.",
    "shortDescription": "Long ago in France there lived a King and Queen.  More than anything, they longed for a child.  At last, to their great happiness, the Queen gave birth to a little girl.",
    "level" : "elementary",
    "language" : "english"
  },
  {
    "title": "The Frog Prince: The Princess and the Frog",
    "source": "storiestogrowby.org",
    "imageUrl": "https://github.com/tranhuudang/Diccon-Assets/raw/main/images/Image-Sketch-4-UPDATED.webp",
    "createdDate": null,
    "content": "Once upon a time there was a Princess.  Many a suitor came to the palace to win her hand in marriage, but it seemed to the Princess that each one of them looked at her without really seeing her at all.  \n“They act like there’s nothing more to a princess than her fine crown and royal dresses,” she said to herself with a frown.\n\nOne afternoon after one of these visits, the Princess thought, “Sometimes I wish I were little again.” She found her favorite ball from childhood, the one that sparkled when she threw it up high to the sun.  She took the ball to the palace yard and threw it higher and higher.\n\n \n\nThe Princess and the Frog\n \n\nOne time she threw it extra high and when she ran to catch the ball, she tripped on a tree stump. The ball fell and plopped right down into the royal well!  She raced over to fetch her ball before it dropped too far, but by the time she got there she could no longer see it in the water.\n\n“Oh no!” she moaned, “This is terrible!”  Just then a small green frog poked its head above the water.  \n\n“Maybe I can help you,” said the Frog.\n\n \n\nThe Princess and the Frog\n \n\n“Yes,” said the Princess. “Please get my ball!”\n\n“No problem,” said the Frog.  “But first there’s something I must ask of you.”\n\n“What do you mean?” said the Princess.\n\n“It’s for you to spend time with me today,” said the Frog.\n\n“I’m not sure I know what that means,” said the Princess.\n\n“Just spend time with me today,” repeated the Frog.\n \n\n“All right then, fine!” said the Princess.  “Now please, get my ball!”\n\n \n\n“I’m on it,” said the Frog.  He dived deep into the well. A few moments later, up he came with the ball held high in one hand.\n“Thank you,” said the Princess, taking it from him.  \n\nShe turned to go.\n\n“Wait a minute!” said the Frog.  “You promised to spend time with me today!”\n\n“I already did,” she said with a shrug.  And the Princess walked back to the palace.\nThat night at dinner with her family and the royal advisers, there was a knock on the door. The servant opened the door and saw no one there. The Frog, standing down low, cleared his throat.\n\n \n\nThe Princess and the Frog\n \n\n“The Princess promised to spend time with me today,” said the Frog in as loud a voice as he could.  “So here I am.”\n\n“Daughter!” said the King from the far end of the table.  “Did you promise to spend time with this Frog, as he claims?”\n\n“Sort of,” said the Princess.  After a pause, she added, “Oh very well, come on in.”\n\n \n\nThe servants quickly set a new place setting for the Frog, and he hopped over to the royal dining table.\n\n \n\nConversation turned to a topic of concern in the kingdom.  None of the royal advisers knew what to do.\n\n“Father, if I may,” said the Princess.  “Perhaps we could–“\n“Stop!” said the King, cutting her off.  “I have enough advisors, believe me.”\n\n“If I may,” said the Frog, and it was the first time he had spoken at the table.  \n\n \n\nThe Princess and the Frog\n \n\n“There’s more to a princess than her fine crown and royal dresses.”\nThe Princess stared at the Frog. How could this little frog – more than anyone else – understand such a thing?\n\nAfter dinner, the Frog bowed to the Princess.  He said, “You have done what you said you would do.  I suppose it’s time now for me to go.”\n\n“No wait!” said the Princess, “it’s not that late.  How about a walk in the garden?”\n\nThe Frog was delighted.  The two of them walked in the royal garden, the Frog hopping along the stone wall so he and the Princess were at the same level and could talk easily.\n \n\nThe Princess and the Frog\n \n\n They laughed about many things. Later, when the sun set, they admired the deep rosy reds it cast in the sky.\n\nThe Princess said, “You know, being with you tonight was a lot more fun than I thought.”\n\n“I had a very good time, too,” said the Frog.\n\n“Who knew?” said the Princess with a laugh. She leaned over and kissed the Frog lightly on his cheek.\n\n \n\nThe Princess and the Frog\n \n\nAt once, there was a puff of clouds and smoke.  The small green frog had changed into a young prince!  The Princess jumped back in surprise, and who could blame her?  The Prince quickly told her not to worry, that all was well. Years before, an evil witch had put a spell on him that he must stay a frog until he was kissed by a princess.\n\nThe witch had laughed an evil laugh, saying, “Like THAT will ever happen!” But it did!\n\nNow the Prince and Princess could get to know each other better.  Years later, after they were married, they had a beautiful setting made for the ball and placed it on their royal dining table.  And when the sunlight shone in through the palace windows, the ball sparkled for all to see.",
    "shortDescription": "Once upon a time there was a Princess.  Many a suitor came to the palace to win her hand in marriage, but it seemed to the Princess that each one of them looked at her without really seeing her at all. ",
    "level" : "elementary",
    "language" : "english"
  }
]
